{"Akromas Will": ["1a00240000ffff02", "Akromas Will Choose one. If you control a commander as you cast this spell, you may choose both.\n• Creatures you control gain flying, vigilance, and double strike until end of turn.\n• Creatures you control gain lifelink, indestructible, and protection from all colors until end of turn."], "Alharu, Solemn Ritualist": ["7c7c00003cffff00", "Alharu, Solemn Ritualist When Alharu, Solemn Ritualist enters the battlefield, put a +1/+1 counter on each of up to two other target creatures.\nWhenever a nontoken creature you control with a +1/+1 counter on it dies, create a 1/1 white Spirit creature token with flying.\nPartner (You can have two commanders if both have partner.)"], "Ancestral Blade": ["1a0000047effff02", "Ancestral Blade When Ancestral Blade enters the battlefield, create a 1/1 white Soldier creature token, then attach Ancestral Blade to it.\nEquipped creature gets +1/+1.\nEquip {1} ({1}: Attach to target creature you control. Equip only as a sorcery.)"], "Angel of the Dawn": ["1e1c1e0000ffff00", "Angel of the Dawn Flying\nWhen Angel of the Dawn enters the battlefield, creatures you control get +1/+1 and gain vigilance until end of turn."], "Angelic Gift": ["0e4200040cffff00", "Angelic Gift Enchant creature\nWhen Angelic Gift enters the battlefield, draw a card.\nEnchanted creature has flying."], "Anointer of Valor": ["7e3424001effff00", "Anointer of Valor Flying\nWhenever a creature attacks, you may pay {3}. When you do, put a +1/+1 counter on that creature."], "Archon of Coronation": ["5e6242000e7f7f00", "Archon of Coronation Flying\nWhen Archon of Coronation enters the battlefield, you become the monarch.\nAs long as you're the monarch, damage doesn't cause you to lose life. (When a creature deals combat damage to you, its controller still becomes the monarch.)"], "Ardenn, Intrepid Archaeologist": ["5e77070040ffff00", "Ardenn, Intrepid Archaeologist At the beginning of combat on your turn, you may attach any number of Auras and Equipment you control to target permanent or player.\nPartner (You can have two commanders if both have partner.)"], "Armored Skyhunter": ["080043627effff00", "Armored Skyhunter Flying\nWhenever Armored Skyhunter attacks, look at the top six cards of your library. You may put an Aura or Equipment card from among them onto the battlefield. If an Equipment is put onto the battlefield this way, you may attach it to a creature you control. Put the rest of those cards on the bottom of your library in a random order."], "Austere Command": ["587a0e00667f7f00", "Austere Command Choose two —\n• Destroy all artifacts.\n• Destroy all enchantments.\n• Destroy all creatures with converted mana cost 3 or less.\n• Destroy all creatures with converted mana cost 4 or greater."], "Benevolent Blessing": ["0c40201e3cffff00", "Benevolent Blessing Flash\nEnchant creature\nAs Benevolent Blessing enters the battlefield, choose a color.\nEnchanted creature has protection from the chosen color. This effect doesn't remove Auras and Equipment you control that are already attached to it."], "Cage of Hands": ["7e7830003effff00", "Cage of Hands Enchant creature\nEnchanted creature can't attack or block.\n{1}{W}: Return Cage of Hands to its owner's hand."], "Captains Call": ["5e4070405effff00", "Captains Call Create three 1/1 white Soldier creature tokens."], "Court of Grace": ["5e4004007effff00", "Court of Grace When Court of Grace enters the battlefield, you become the monarch.\nAt the beginning of your upkeep, create a 1/1 white Spirit creature token with flying. If you're the monarch, create a 4/4 white Angel creature token with flying instead."], "Court Street Denizen": ["1c1a524246ffff00", "Court Street Denizen Whenever another white creature enters the battlefield under your control, tap target creature an opponent controls."], "Dispellers Capsule": ["064222407e7f7f00", "Dispellers Capsule {2}{W}, {T}, Sacrifice Dispeller's Capsule: Destroy target artifact or enchantment."], "Doomed Traveler": ["0000013a3effff00", "Doomed Traveler When Doomed Traveler dies, create a 1/1 white Spirit creature token with flying."], "Faiths Fetters": ["7e1c000004ffff02", "Faiths Fetters Enchant permanent\nWhen Faith's Fetters enters the battlefield, you gain 4 life.\nEnchanted permanent can't attack or block, and its activated abilities can't be activated unless they're mana abilities."], "Fencing Ace": ["5c001e0406ffff00", "Fencing Ace Double strike"], "First Response": ["7ec0000016ffff66", "First Response At the beginning of each upkeep, if you lost life last turn, create a 1/1 white Soldier creature token."], "Inspiring Roar": ["7e6060003cffff00", "Inspiring Roar Put a +1/+1 counter on each creature you control."], "Intangible Virtue": ["4e40400062ffff00", "Intangible Virtue Creature tokens you control get +1/+1 and have vigilance."], "Ionas Judgment": ["1e1e1c007effff00", "Ionas Judgment Exile target creature or enchantment."], "Kangees Lieutenant": ["0e3a7e0e0c7f7f00", "Kangees Lieutenant Flying\nWhenever Kangee's Lieutenant attacks, attacking creatures with flying get +1/+1 until end of turn.\nEncore {5}{W} ({5}{W}, Exile this card from your graveyard: For each opponent, create a token copy that attacks that opponent this turn if able. They gain haste. Sacrifice them at the beginning of the next end step. Activate only as a sorcery.)"], "Keeper of the Accord": ["04186070787f7f00", "Keeper of the Accord At the beginning of each opponent's end step, if that player controls more creatures than you, create a 1/1 white Soldier creature token.\nAt the beginning of each opponent's end step, if that player controls more lands than you, you may search your library for a basic Plains card, put it onto the battlefield tapped, then shuffle your library."], "Keleth, Sunmane Familiar": ["7e1c00007effff02", "Keleth, Sunmane Familiar Whenever a commander you control attacks, put a +1/+1 counter on it.\nPartner (You can have two commanders if both have partner.)"], "Kinsbaile Courier": ["18766640427f7f00", "Kinsbaile Courier When Kinsbaile Courier enters the battlefield, put a +1/+1 counter on target creature.\nEncore {2}{W} ({2}{W}, Exile this card from your graveyard: For each opponent, create a token copy that attacks that opponent this turn if able. They gain haste. Sacrifice them at the beginning of the next end step. Activate only as a sorcery.)"], "Kor Cartographer": ["7e34200006ffff00", "Kor Cartographer When Kor Cartographer enters the battlefield, you may search your library for a Plains card, put it onto the battlefield tapped, then shuffle your library."], "Livio, Oathsworn Sentinel": ["0e4242027e7f7f00", "Livio, Oathsworn Sentinel {1}{W}: Choose another target creature. Its controller may exile it with an aegis counter on it.\n{2}{W}, {T}: Return all exiled cards with aegis counters on them to the battlefield under their owners' control.\nPartner (You can have two commanders if both have partner.)"], "Make a Stand": ["5ee3014040ffff00", "Make a Stand Creatures you control get +1/+0 and gain indestructible until end of turn. (Damage and effects that say \"destroy\" don't destroy them.)"], "Ninth Bridge Patrol": ["1e7e7e00307f7f00", "Ninth Bridge Patrol Whenever another creature you control leaves the battlefield, put a +1/+1 counter on Ninth Bridge Patrol."], "Open the Armory": ["7e0c0c0446ffff00", "Open the Armory Search your library for an Aura or Equipment card, reveal it, put it into your hand, then shuffle your library."], "Orzhov Advokist": ["7e0000007effff00", "Orzhov Advokist At the beginning of your upkeep, each player may put two +1/+1 counters on a creature they control. If a player does, creatures that player controls can't attack you or a planeswalker you control until your next turn."], "Palace Sentinels": ["7e0003082effff02", "Palace Sentinels When Palace Sentinels enters the battlefield, you become the monarch."], "Patron of the Valiant": ["4e0060000effff42", "Patron of the Valiant Flying\nWhen Patron of the Valiant enters the battlefield, put a +1/+1 counter on each creature you control with a +1/+1 counter on it."], "Prava of the Steel Legion": ["1e0a42027e7fff00", "Prava of the Steel Legion As long as it's your turn, creature tokens you control get +1/+4.\n{3}{W}: Create a 1/1 white Soldier creature token.\nPartner (You can have two commanders if both have partner.)"], "Promise of Tomorrow": ["1874620040ff7f00", "Promise of Tomorrow Whenever a creature you control dies, exile it.\nAt the beginning of each end step, if you control no creatures, sacrifice Promise of Tomorrow and return all cards exiled with it to the battlefield under your control."], "Radiant, Serra Archangel": ["041c7e0818ffff00", "Radiant, Serra Archangel Flying\nTap another untapped creature you control with flying: Radiant, Serra Archangel gains protection from the color of your choice until end of turn.\nPartner (You can have two commanders if both have partner.)"], "Raise the Alarm": ["383c716306ff7f00", "Raise the Alarm Create two 1/1 white Soldier creature tokens."], "Rebbec, Architect of Ascension": ["7e48000036ffff00", "Rebbec, Architect of Ascension Artifacts you control have protection from each converted mana cost among artifacts you control.\nPartner (You can have two commanders if both have partner.)"], "Return to Dust": ["187e4a0000ffff00", "Return to Dust Exile target artifact or enchantment. If you cast this spell during your main phase, you may exile up to one other target artifact or enchantment."], "Seraph of Dawn": ["0c181e002cffff00", "Seraph of Dawn Flying, lifelink"], "Seraphic Greatsword": ["0e1e24000effff00", "Seraphic Greatsword Equipped creature gets +2/+2.\nWhenever equipped creature attacks the player with the most life or tied for most life, create a 4/4 white Angel creature token with flying that's tapped and attacking that player.\nEquip {4}"], "Skywhalers Shot": ["7e000e000effff62", "Skywhalers Shot Destroy target creature with power 3 or greater. Scry 1. (Look at the top card of your library. You may put that card on the bottom of your library.)"], "Slash the Ranks": ["5e7020003effff00", "Slash the Ranks Destroy all creatures and planeswalkers except for commanders."], "Slaughter the Strong": ["7e760042727f7f00", "Slaughter the Strong Each player chooses any number of creatures they control with total power 4 or less, then sacrifices all other creatures they control."], "Slith Ascendant": ["7e0f020006ffff00", "Slith Ascendant Flying\nWhenever Slith Ascendant deals combat damage to a player, put a +1/+1 counter on it."], "Soul of Eternity": ["08004676607f7f00", "Soul of Eternity Soul of Eternity's power and toughness are each equal to your life total.\nEncore {7}{W}{W} ({7}{W}{W}, Exile this card from your graveyard: For each opponent, create a token copy that attacks that opponent this turn if able. They gain haste. Sacrifice them at the beginning of the next end step. Activate only as a sorcery.)"], "Squad Captain": ["5e08081c1cffff02", "Squad Captain Vigilance\nSquad Captain enters the battlefield with a +1/+1 counter on it for each other creature you control."], "Triumphant Reckoning": ["1e660000667fff00", "Triumphant Reckoning Return all artifact, enchantment, and planeswalker cards from your graveyard to the battlefield."], "Trusty Packbeast": ["007e7e7e087e7e00", "Trusty Packbeast When Trusty Packbeast enters the battlefield, return target artifact card from your graveyard to your hand."], "Vow of Duty": ["7e70700000ffff00", "Vow of Duty Enchant creature\nEnchanted creature gets +2/+2, has vigilance, and can't attack you or a planeswalker you control."], "Amphin Mutineer": ["184476067e7f7f00", "Amphin Mutineer When Amphin Mutineer enters the battlefield, exile up to one target non-Salamander creature. That creature's controller creates a 4/3 blue Salamander Warrior creature token.\nEncore {4}{U}{U} ({4}{U}{U}, Exile this card from your graveyard: For each opponent, create a token copy that attacks that opponent this turn if able. They gain haste. Sacrifice them at the beginning of the next end step. Activate only as a sorcery.)"], "Aqueous Form": ["5e00000032ffff72", "Aqueous Form Enchant creature\nEnchanted creature can't be blocked.\nWhenever enchanted creature attacks, scry 1. (Look at the top card of your library. You may put that card on the bottom of your library.)"], "Aven Surveyor": ["1e00070006ffff66", "Aven Surveyor Flying\nWhen Aven Surveyor enters the battlefield, choose one —\n• Put a +1/+1 counter on Aven Surveyor.\n• Return target creature to its owner's hand."], "Azure Fleet Admiral": ["1e0000627e7fff02", "Azure Fleet Admiral When Azure Fleet Admiral enters the battlefield, you become the monarch.\nAzure Fleet Admiral can't be blocked by creatures the monarch controls."], "Body of Knowledge": ["4e5b300040ffff02", "Body of Knowledge Body of Knowledge's power and toughness are each equal to the number of cards in your hand.\nYou have no maximum hand size.\nWhenever Body of Knowledge is dealt damage, draw that many cards."], "Brinelin, the Moon Kraken": ["00003c1c7e7f7f00", "Brinelin, the Moon Kraken When Brinelin, the Moon Kraken enters the battlefield or whenever you cast a spell with converted mana cost 6 or greater, you may return target nonland permanent to its owner's hand.\nPartner (You can have two commanders if both have partner.)"], "Flood of Recollection": ["1000042c1affff46", "Flood of Recollection Return target instant or sorcery card from your graveyard to your hand. Exile Flood of Recollection."], "Confiscate": ["006e4e30207f7f00", "Confiscate Enchant permanent\nYou control enchanted permanent."], "Court of Cunning": ["1c4600003e7f7f00", "Court of Cunning When Court of Cunning enters the battlefield, you become the monarch.\nAt the beginning of your upkeep, any number of target players each mill two cards. If you're the monarch, each of those players mills ten cards instead. (To mill a card, a player puts the top card of their library into their graveyard.)"], "Daring Saboteur": ["0e00700034ffff42", "Daring Saboteur {2}{U}: Daring Saboteur can't be blocked this turn.\nWhenever Daring Saboteur deals combat damage to a player, you may draw a card. If you do, discard a card."], "Deranged Assistant": ["1e0000007effff42", "Deranged Assistant {T}, Mill a card: Add {C}. (To mill a card, put the top card of your library into your graveyard.)"], "Eligeth, Crossroads Augur": ["7e20000000ffff42", "Eligeth, Crossroads Augur Flying\nIf you would scry a number of cards, draw that many cards instead.\nPartner (You can have two commanders if both have partner.)"], "Esior, Wardwing Familiar": ["326a000032ffff02", "Esior, Wardwing Familiar Flying\nSpells your opponents cast that target one or more commanders you control cost {3} more to cast.\nPartner (You can have two commanders if both have partner.)"], "Fall from Favor": ["000602007e7f7f00", "Fall from Favor Enchant creature\nWhen Fall from Favor enters the battlefield, tap enchanted creature and you become the monarch.\nEnchanted creature doesn't untap during its controller's untap step unless that player is the monarch."], "Forceful Denial": ["0c7c5c60007f7f00", "Forceful Denial Cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)\nCounter target spell."], "Galestrike": ["0c0e0c7c7e7f7f00", "Galestrike Return target tapped creature to its owner's hand.\nDraw a card."], "Ghost of Ramirez DePietro": ["0c2650103c7f7f00", "Ghost of Ramirez DePietro Ghost of Ramirez DePietro can't be blocked by creatures with toughness 3 or greater.\nWhenever Ghost of Ramirez DePietro deals combat damage to a player, choose up to one target card in a graveyard that was discarded or put there from a library this turn. Put that card into its owner's hand.\nPartner (You can have two commanders if both have partner.)"], "Glacian, Powerstone Engineer": ["0c04060006ffff02", "Glacian, Powerstone Engineer {T}, Tap X untapped artifacts you control: Look at the top X cards of your library. Put one of those cards into your hand and the rest into your graveyard.\nPartner (You can have two commanders if both have partner.)"], "Horizon Scholar": ["1c04030008ffff42", "Horizon Scholar Flying\nWhen Horizon Scholar enters the battlefield, scry 2. (Look at the top two cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.)"], "Hullbreacher": ["1e4242403e7f7f00", "Hullbreacher Flash\nIf an opponent would draw a card except the first one they draw in each of their draw steps, instead you create a Treasure token. (It's an artifact with \"{T}, Sacrifice this artifact: Add one mana of any color.\")"], "Interpret the Signs": ["5e0060007cffff72", "Interpret the Signs Scry 3, then reveal the top card of your library. Draw cards equal to that card's converted mana cost. (To scry 3, look at the top three cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.)"], "Kitesail Corsair": ["1e7e3818387f7f00", "Kitesail Corsair Kitesail Corsair has flying as long as it's attacking."], "Kitesail Skirmisher": ["0c02004e7e7f7f00", "Kitesail Skirmisher Flying\nWhenever Kitesail Skirmisher attacks, another target creature attacking the same player or planeswalker gains flying until end of turn.\nEncore {4}{U} ({4}{U}, Exile this card from your graveyard: For each opponent, create a token copy that attacks that opponent this turn if able. They gain haste. Sacrifice them at the beginning of the next end step. Activate only as a sorcery.)"], "Laboratory Drudge": ["0e0242667e7f7f00", "Laboratory Drudge At the beginning of each end step, draw a card if you've cast a spell from a graveyard or activated an ability of a card in a graveyard this turn."], "Malcolm, Keen-Eyed Navigator": ["0e00020266ffff02", "Malcolm, Keen-Eyed Navigator Flying\nWhenever one or more Pirates you control deal damage to your opponents, you create a Treasure token for each opponent dealt damage. (It's an artifact with \"{T}, Sacrifice this artifact: Add one mana of any color.\")\nPartner (You can have two commanders if both have partner.)"], "Mana Drain": ["087222063e7f7f00", "Mana Drain Counter target spell. At the beginning of your next main phase, add an amount of {C} equal to that spell's converted mana cost."], "Merchant Raiders": ["7e0000005effff40", "Merchant Raiders Whenever Merchant Raiders or another Pirate enters the battlefield under your control, tap up to one target creature. That creature doesn't untap during its controller's untap step for as long as you control Merchant Raiders."], "Mnemonic Deluge": ["1e0c20000cffff02", "Mnemonic Deluge Exile target instant or sorcery card from a graveyard. Copy that card three times. You may cast the copies without paying their mana costs. Exile Mnemonic Deluge."], "Omenspeaker": ["6e0c0a006effff00", "Omenspeaker When Omenspeaker enters the battlefield, scry 2. (Look at the top two cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.)"], "Preordain": ["121030647e7f7f00", "Preordain Scry 2, then draw a card. (To scry 2, look at the top two cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.)"], "Prosperous Pirates": ["4240003c7e7f7f00", "Prosperous Pirates When Prosperous Pirates enters the battlefield, create two Treasure tokens. (They're artifacts with \"{T}, Sacrifice this artifact: Add one mana of any color.\")"], "Prying Eyes": ["7e50500046ffff00", "Prying Eyes Draw four cards, then discard two cards."], "Run Away Together": ["7c70300078ffff00", "Run Away Together Choose two target creatures controlled by different players. Return those creatures to their owners' hands."], "Sailor of Means": ["0e0c00027e7f7f00", "Sailor of Means When Sailor of Means enters the battlefield, create a Treasure token. (It's an artifact with \"{T}, Sacrifice this artifact: Add one mana of any color.\")"], "Sakashima of a Thousand Faces": ["5e07000006ffff62", "Sakashima of a Thousand Faces You may have Sakashima of a Thousand Faces enter the battlefield as a copy of another creature you control, except it has Sakashima of a Thousand Faces's other abilities.\nThe \"legend rule\" doesn't apply to permanents you control.\nPartner (You can have two commanders if both have partner.)"], "Sakashimas Protege": ["1832024044ffff00", "Sakashimas Protege Flash\nCascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)\nYou may have Sakashima's Protege enter the battlefield as a copy of any permanent that entered the battlefield this turn."], "Sakashimas Will": ["3c66660000ffff00", "Sakashimas Will Choose one. If you control a commander as you cast this spell, you may choose both.\n• Target opponent chooses a creature they control. You gain control of it.\n• Choose a creature you control. Each other creature you control becomes a copy of that creature until end of turn."], "Scholar of Stars": ["000050787e7e7f00", "Scholar of Stars When Scholar of Stars enters the battlefield, if you control an artifact, draw a card."], "Scholar of the Ages": ["7e00000040ffff62", "Scholar of the Ages When Scholar of the Ages enters the battlefield, return up to two target instant and/or sorcery cards from your graveyard to your hand."], "Scrapdiver Serpent": ["3a7c6400067f7f00", "Scrapdiver Serpent Scrapdiver Serpent can't be blocked as long as defending player controls an artifact."], "Siani, Eye of the Storm": ["0e00120008ffff42", "Siani, Eye of the Storm Flying\nWhenever Siani, Eye of the Storm attacks, scry X, where X is the number of attacking creatures with flying.\nPartner (You can have two commanders if both have partner.)"], "Siren Stormtamer": ["181c06001cffff42", "Siren Stormtamer Flying\n{U}, Sacrifice Siren Stormtamer: Counter target spell or ability that targets you or a creature you control."], "Skaab Goliath": ["7e02030006ffff6e", "Skaab Goliath As an additional cost to cast this spell, exile two creature cards from your graveyard.\nTrample"], "Skilled Animator": ["5e00000044ffff66", "Skilled Animator When Skilled Animator enters the battlefield, target artifact you control becomes an artifact creature with base power and toughness 5/5 for as long as Skilled Animator remains on the battlefield."], "Sphinx of the Second Sun": ["3e00000062ffff7e", "Sphinx of the Second Sun Flying\nAt the beginning of your postcombat main phase, there is an additional beginning phase after this phase. (The beginning phase includes the untap, upkeep, and draw steps.)"], "Spontaneous Mutation": ["467e22004e7f7f00", "Spontaneous Mutation Flash\nEnchant creature\nEnchanted creature gets -X/-0, where X is the number of cards in your graveyard."], "Strategic Planning": ["5e0000001effff76", "Strategic Planning Look at the top three cards of your library. Put one of them into your hand and the rest into your graveyard."], "Supreme Will": ["0c00181838ffff00", "Supreme Will Choose one —\n• Counter target spell unless its controller pays {3}.\n• Look at the top four cards of your library. Put one of them into your hand and the rest on the bottom of your library in any order."], "Thirst for Knowledge": ["1c0028003cffff00", "Thirst for Knowledge Draw three cards. Then discard two cards unless you discard an artifact card."], "Trove Tracker": ["0e0e0f0902ffff00", "Trove Tracker When Trove Tracker dies, draw a card.\nEncore {5}{U}{U} ({5}{U}{U}, Exile this card from your graveyard: For each opponent, create a token copy that attacks that opponent this turn if able. They gain haste. Sacrifice them at the beginning of the next end step. Activate only as a sorcery.)"], "Vow of Flight": ["186462303e7e7e00", "Vow of Flight Enchant creature\nEnchanted creature gets +2/+2, has flying, and can't attack you or a planeswalker you control."], "Warden of Evos Isle": ["1e30341018ffff00", "Warden of Evos Isle Flying\nCreature spells with flying you cast cost {1} less to cast."], "Wrong Turn": ["0e00000000ffff02", "Wrong Turn Target opponent gains control of target creature. (If an attacking or blocking creature changes controllers, it's removed from combat.)"], "Armix, Filigree Thrasher": ["1e0000007effff42", "Armix, Filigree Thrasher Whenever Armix, Filigree Thrasher attacks, you may discard a card. When you do, target creature defending player controls gets -X/-X until end of turn, where X is the number of artifacts you control plus the number of artifact cards in your graveyard.\nPartner (You can have two commanders if both have partner.)"], "Bitter Revelation": ["0068c01030ffff02", "Bitter Revelation Look at the top four cards of your library. Put two of them into your hand and the rest into your graveyard. You lose 2 life."], "Bladebrand": ["00021a00407fff46", "Bladebrand Target creature gains deathtouch until end of turn.\nDraw a card."], "Briarblade Adept": ["1800000076ffff66", "Briarblade Adept Whenever Briarblade Adept attacks, target creature an opponent controls gets -1/-1 until end of turn.\nEncore {3}{B} ({3}{B}, Exile this card from your graveyard: For each opponent, create a token copy that attacks that opponent this turn if able. They gain haste. Sacrifice them at the beginning of the next end step. Activate only as a sorcery.)"], "Cast Down": ["0e06000000ffff7e", "Cast Down Destroy target nonlegendary creature."], "Corpse Churn": ["0000080072ffff7e", "Corpse Churn Mill three cards, then you may return a creature card from your graveyard to your hand. (To mill a card, put the top card of your library into your graveyard.)"], "Court of Ambition": ["083c3c00007fff46", "Court of Ambition When Court of Ambition enters the battlefield, you become the monarch.\nAt the beginning of your upkeep, each opponent loses 3 life unless they discard a card. If you're the monarch, instead each opponent loses 6 life unless they discard two cards."], "Crow of Dark Tidings": ["000414043c7fff7e", "Crow of Dark Tidings Flying\nWhen Crow of Dark Tidings enters the battlefield or dies, mill two cards. (Put the top two cards of your library into your graveyard.)"], "Cuombajj Witches": ["0c0c00002e7fff5e", "Cuombajj Witches {T}: Cuombajj Witches deals 1 damage to any target and 1 damage to any target of an opponent's choice."], "Defiant Salvager": ["060e703000ffff66", "Defiant Salvager Sacrifice an artifact or creature: Put a +1/+1 counter on Defiant Salvager. Activate this ability only any time you could cast a sorcery."], "Demonic Lore": ["087e0e00007e7e02", "Demonic Lore When Demonic Lore enters the battlefield, draw three cards.\nAt the beginning of your end step, you lose 2 life for each card in your hand."], "Dhund Operative": ["00004400027fff46", "Dhund Operative As long as you control an artifact, Dhund Operative gets +1/+0 and has deathtouch."], "Elvish Doomsayer": ["000e0e0e0e7e7e42", "Elvish Doomsayer When Elvish Doomsayer dies, each opponent discards a card."], "Elvish Dreadlord": ["0e00000046ffff7e", "Elvish Dreadlord Deathtouch\nWhen Elvish Dreadlord dies, non-Elf creatures get -3/-3 until end of turn.\nEncore {5}{B}{B} ({5}{B}{B}, Exile this card from your graveyard: For each opponent, create a token copy that attacks that opponent this turn if able. They gain haste. Sacrifice them at the beginning of the next end step. Activate only as a sorcery.)"], "Exquisite Huntmaster": ["1c0000006effff7e", "Exquisite Huntmaster When Exquisite Huntmaster dies, create a 1/1 green Elf Warrior creature token.\nEncore {4}{B} ({4}{B}, Exile this card from your graveyard: For each opponent, create a token copy that attacks that opponent this turn if able. They gain haste. Sacrifice them at the beginning of the next end step. Activate only as a sorcery.)"], "Eyeblight Assassin": ["00723000067f7f42", "Eyeblight Assassin When Eyeblight Assassin enters the battlefield, target creature an opponent controls gets -1/-1 until end of turn."], "Eyeblight Cullers": ["040e0604067f7f42", "Eyeblight Cullers When Eyeblight Cullers dies, create three 1/1 green Elf Warrior creature tokens, then mill three cards. (Put the top three cards of your library into your graveyard.)"], "Eyeblight Massacre": ["021a0800347e7e02", "Eyeblight Massacre Non-Elf creatures get -2/-2 until end of turn."], "Falthis, Shadowcat Familiar": ["00785800007f7e42", "Falthis, Shadowcat Familiar Commanders you control have menace and deathtouch.\nPartner (You can have two commanders if both have partner.)"], "Feast of Succession": ["000202027e7e7e02", "Feast of Succession All creatures get -4/-4 until end of turn. You become the monarch."], "Fleshbag Marauder": ["0c380000347fff66", "Fleshbag Marauder When Fleshbag Marauder enters the battlefield, each player sacrifices a creature."], "Ghastly Demise": ["007e72067e7e7e00", "Ghastly Demise Destroy target nonblack creature if its toughness is less than or equal to the number of cards in your graveyard."], "Gilt-Leaf Winnower": ["007440407e7e7e00", "Gilt-Leaf Winnower Menace (This creature can't be blocked except by two or more creatures.)\nWhen Gilt-Leaf Winnower enters the battlefield, you may destroy target non-Elf creature whose power and toughness aren't equal."], "Keskit, the Flesh Sculptor": ["061e0200007f7f66", "Keskit, the Flesh Sculptor {T}, Sacrifice three other artifacts and/or creatures: Look at the top three cards of your library. Put two of them into your hand and the other into your graveyard.\nPartner (You can have two commanders if both have partner.)"], "Maalfeld Twins": ["002006407e7f7f42", "Maalfeld Twins When Maalfeld Twins dies, create two 2/2 black Zombie creature tokens."], "Miara, Thorn of the Glade": ["10060600027fff46", "Miara, Thorn of the Glade Whenever Miara, Thorn of the Glade or another Elf you control dies, you may pay {1} and 1 life. If you do, draw a card.\nPartner (You can have two commanders if both have partner.)"], "Murder": ["107e2e00007e7e02", "Murder Destroy target creature."], "Nadier, Agent of the Duskenel": ["0400180000ffff7e", "Nadier, Agent of the Duskenel Whenever a token you control leaves the battlefield, put a +1/+1 counter on Nadier, Agent of the Duskenel.\nWhen Nadier leaves the battlefield, create a number of 1/1 green Elf Warrior creature tokens equal to its power.\nPartner (You can have two commanders if both have partner.)"], "Nadiers Nightblade": ["3222200006ffff7e", "Nadiers Nightblade Whenever a token you control leaves the battlefield, each opponent loses 1 life and you gain 1 life."], "Necrotic Hex": ["0600000006ffff7e", "Necrotic Hex Each player sacrifices six creatures. You create six tapped 2/2 black Zombie creature tokens."], "Nightshade Harvester": ["0e5e08001e7e7e02", "Nightshade Harvester Whenever a land enters the battlefield under an opponent's control, that player loses 1 life. Put a +1/+1 counter on Nightshade Harvester."], "Noxious Dragon": ["00747000607e7e02", "Noxious Dragon Flying\nWhen Noxious Dragon dies, you may destroy target creature with converted mana cost 3 or less."], "Null Caller": ["007a4040667e7e00", "Null Caller {3}{B}, Exile a creature card from your graveyard: Create a tapped 2/2 black Zombie creature token."], "Opposition Agent": ["105e4004007e7e02", "Opposition Agent Flash\nYou control your opponents while they're searching their libraries.\nWhile an opponent is searching their library, they exile each card they find. You may play those cards for as long as they remain exiled, and you may spend mana as though it were mana of any color to cast them."], "Phyrexian Rager": ["02420602027f7e42", "Phyrexian Rager When Phyrexian Rager enters the battlefield, you draw a card and you lose 1 life."], "Plague Reaver": ["02060e007e7e7e00", "Plague Reaver At the beginning of your end step, sacrifice each other creature you control.\nDiscard two cards, Sacrifice Plague Reaver: Choose target opponent. Return Plague Reaver to the battlefield under that player's control at the beginning of their next upkeep."], "Pride of the Perfect": ["00666260707e7e02", "Pride of the Perfect Elves you control get +2/+0."], "Profane Transfusion": ["1c3e0000107fff66", "Profane Transfusion Two target players exchange life totals. You create an X/X colorless Horror artifact creature token, where X is the difference between those players' life totals."], "Rakshasa Debaser": ["047e0200047e7e00", "Rakshasa Debaser Whenever Rakshasa Debaser attacks, put target creature card from defending player's graveyard onto the battlefield under your control.\nEncore {6}{B}{B} ({6}{B}{B}, Exile this card from your graveyard: For each opponent, create a token copy that attacks that opponent this turn if able. They gain haste. Sacrifice them at the beginning of the next end step. Activate only as a sorcery.)"], "Revenant": ["007404066e7e7e00", "Revenant Flying\nRevenant's power and toughness are each equal to the number of creature cards in your graveyard."], "Sanitarium Skeleton": ["000040007e7fff7e", "Sanitarium Skeleton {2}{B}: Return Sanitarium Skeleton from your graveyard to your hand."], "Sengir, the Dark Baron": ["00726202067e7e00", "Sengir, the Dark Baron Flying\nWhenever another creature dies, put two +1/+1 counters on Sengir, the Dark Baron.\nWhenever another player loses the game, you gain life equal to that player's life total as the turn began.\nPartner (You can have two commanders if both have partner.)"], "Spark Harvest": ["187802063e7e7e02", "Spark Harvest As an additional cost to cast this spell, sacrifice a creature or pay {3}{B}.\nDestroy target creature or planeswalker."], "Supernatural Stamina": ["18300000087fff76", "Supernatural Stamina Until end of turn, target creature gets +2/+0 and gains \"When this creature dies, return it to the battlefield tapped under its owner's control.\""], "Szats Will": ["16404000107fff76", "Szats Will Choose one. If you control a commander as you cast this spell, you may choose both.\n• Each opponent sacrifices a creature they control with the greatest power.\n• Exile all cards from all opponents' graveyards, then create X 0/1 black Thrull creature tokens, where X is the greatest power among creature cards exiled this way."], "Tevesh Szat, Doom of Fools": ["1e00000c2cffff7e", "Tevesh Szat, Doom of Fools +2: Create two 0/1 black Thrull creature tokens.\n+1: You may sacrifice another creature or planeswalker. If you do, draw two cards, then draw another card if the sacrificed permanent was a commander.\n−10: Gain control of all commanders. Put all commanders from the command zone onto the battlefield under your control.\nTevesh Szat, Doom of Fools can be your commander.\nPartner"], "Thorn of the Black Rose": ["764604007e7f7f00", "Thorn of the Black Rose Deathtouch\nWhen Thorn of the Black Rose enters the battlefield, you become the monarch."], "Tormod, the Desecrator": ["004050000e7fff42", "Tormod, the Desecrator Whenever one or more cards leave your graveyard, create a tapped 2/2 black Zombie creature token.\nPartner (You can have two commanders if both have partner.)"], "Vampiric Tutor": ["00020600007fff42", "Vampiric Tutor Search your library for a card, then shuffle your library and put that card on top of it. You lose 2 life."], "Victimize": ["6a0010003effff7e", "Victimize Choose two target creature cards in your graveyard. Sacrifice a creature. If you do, return the chosen cards to the battlefield tapped."], "Viscera Seer": ["100000063e7fff46", "Viscera Seer Sacrifice a creature: Scry 1. (Look at the top card of your library. You may put that card on the bottom of your library.)"], "Vow of Torment": ["1e00000010ffff7e", "Vow of Torment Enchant creature\nEnchanted creature gets +2/+2, has menace, and can't attack you or a planeswalker you control. (It can't be blocked except by two or more creatures.)"], "Alena, Kessig Trapper": ["08081000767fff56", "Alena, Kessig Trapper First strike\n{T}: Add an amount of {R} equal to the greatest power among creatures you control that entered the battlefield this turn.\nPartner (You can have two commanders if both have partner.)"], "Aurora Phoenix": ["1e26020026ffff42", "Aurora Phoenix Flying\nCascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)\nWhenever you cast a spell with cascade, return Aurora Phoenix from your graveyard to your hand."], "Blasphemous Act": ["08000e0c3e7f7f02", "Blasphemous Act This spell costs {1} less to cast for each creature on the battlefield.\nBlasphemous Act deals 13 damage to each creature."], "Boarding Party": ["5e001c0000ffff6e", "Boarding Party Haste\nCascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)"], "Brazen Freebooter": ["0e4e02060e7e7f02", "Brazen Freebooter When Brazen Freebooter enters the battlefield, create a Treasure token. (It's an artifact with \"{T}, Sacrifice this artifact: Add one mana of any color.\")"], "Breeches, Brazen Plunderer": ["7e0c00000effff7e", "Breeches, Brazen Plunderer Menace\nWhenever one or more Pirates you control deal damage to your opponents, exile the top card of each of those opponents' libraries. You may play those cards this turn, and you may spend mana as though it were mana of any color to cast those spells.\nPartner (You can have two commanders if both have partner.)"], "Burning Anger": ["487400007a7fff02", "Burning Anger Enchant creature\nEnchanted creature has \"{T}: This creature deals damage equal to its power to any target.\""], "Champion of the Flame": ["000c2c001cffff46", "Champion of the Flame Trample\nChampion of the Flame gets +2/+2 for each Aura and Equipment attached to it."], "Coastline Marauders": ["007a6200067e7f00", "Coastline Marauders Trample\nWhenever Coastline Marauders attacks, it gets +1/+0 until end of turn for each land defending player controls.\nEncore {4}{R}{R} ({4}{R}{R}, Exile this card from your graveyard: For each opponent, create a token copy that attacks that opponent this turn if able. They gain haste. Sacrifice them at the beginning of the next end step. Activate only as a sorcery.)"], "Coercive Recruiter": ["0e06020008ffff42", "Coercive Recruiter Whenever Coercive Recruiter or another Pirate enters the battlefield under your control, gain control of target creature until end of turn. Untap that creature. Until end of turn, it gains haste and becomes a Pirate in addition to its other types."], "Court of Ire": ["7e7e3010027fff42", "Court of Ire When Court of Ire enters the battlefield, you become the monarch.\nAt the beginning of your upkeep, Court of Ire deals 2 damage to any target. If you're the monarch, it deals 7 damage instead."], "Crimson Fleet Commodore": ["1c000e0000ffff42", "Crimson Fleet Commodore Trample\nWhen Crimson Fleet Commodore enters the battlefield, you become the monarch."], "Dargo, the Shipwrecker": ["2646420000ffff42", "Dargo, the Shipwrecker As an additional cost to cast this spell, you may sacrifice any number of artifacts and/or creatures. This spell costs {2} less to cast for each permanent sacrificed this way and {2} less to cast for each other artifact or creature you've sacrificed this turn.\nTrample\nPartner (You can have two commanders if both have partner.)"], "Dragon Egg": ["006646067e7e7e00", "Dragon Egg Defender\nWhen Dragon Egg dies, create a 2/2 red Dragon creature token with flying and \"{R}: This creature gets +1/+0 until end of turn.\""], "Dragon Mantle": ["7e1010000effff66", "Dragon Mantle Enchant creature\nWhen Dragon Mantle enters the battlefield, draw a card.\nEnchanted creature has \"{R}: This creature gets +1/+0 until end of turn.\""], "Emberwilde Captain": ["0c7e46464e7e7f00", "Emberwilde Captain When Emberwilde Captain enters the battlefield, you become the monarch.\nWhenever an opponent attacks you while you're the monarch, Emberwilde Captain deals damage to that player equal to the number of cards in their hand."], "Explosion of Riches": ["0600000002ffff62", "Explosion of Riches Draw a card, then each other player may draw a card. Whenever a card is drawn this way, Explosion of Riches deals 5 damage to target opponent chosen at random from among your opponents."], "Fathom Fleet Swordjack": ["440006000effff42", "Fathom Fleet Swordjack Whenever Fathom Fleet Swordjack attacks, it deals damage to the player or planeswalker it's attacking equal to the number of artifacts you control.\nEncore {5}{R} ({5}{R}, Exile this card from your graveyard: For each opponent, create a token copy that attacks that opponent this turn if able. They gain haste. Sacrifice them at the beginning of the next end step. Activate only as a sorcery.)"], "Fiery Cannonade": ["06420206067e7f02", "Fiery Cannonade Fiery Cannonade deals 2 damage to each non-Pirate creature."], "Flamekin Herald": ["4e00200010ffff6e", "Flamekin Herald Commander spells you cast have cascade. (Whenever you cast a commander, exile cards from the top of your library until you exile a nonland card with lesser converted mana cost. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)"], "Frenzied Saddlebrute": ["1e1e0000667fff42", "Frenzied Saddlebrute Haste\nAll creatures can attack your opponents and planeswalkers your opponents control as though those creatures had haste."], "Furnace Celebration": ["1c0e040010ffff42", "Furnace Celebration Whenever you sacrifice another permanent, you may pay {2}. If you do, Furnace Celebration deals 2 damage to any target."], "Goblin Trailblazer": ["0c7c7800107f7f00", "Goblin Trailblazer Menace (This creature can't be blocked except by two or more creatures.)"], "Hellkite Courser": ["181804207e7fff02", "Hellkite Courser Flying\nWhen Hellkite Courser enters the battlefield, you may put a commander you own from the command zone onto the battlefield. It gains haste. Return it to the command zone at the beginning of the next end step."], "Humble Defector": ["1c1822001c7fff02", "Humble Defector {T}: Draw two cards. Target opponent gains control of Humble Defector. Activate this ability only during your turn."], "Impulsive Pilferer": ["087e6404067e7e00", "Impulsive Pilferer When Impulsive Pilferer dies, create a Treasure token. (It's an artifact with \"{T}, Sacrifice this artifact: Add one mana of any color.\")\nEncore {3}{R} ({3}{R}, Exile this card from your graveyard: For each opponent, create a token copy that attacks that opponent this turn if able. They gain haste. Sacrifice them at the beginning of the next end step. Activate only as a sorcery.)"], "Jeska, Thrice Reborn": ["08780610467f7f02", "Jeska, Thrice Reborn Jeska, Thrice Reborn enters the battlefield with a loyalty counter on her for each time you've cast a commander from the command zone this game.\n0: Choose target creature. Until your next turn, if that creature would deal combat damage to one of your opponents, it deals triple that damage to that player instead.\n−X: Jeska, Thrice Reborn deals X damage to each of up to three targets.\nJeska, Thrice Reborn can be your commander.\nPartner"], "Jeskas Will": ["7e6602007e7f7e00", "Jeskas Will Choose one. If you control a commander as you cast this spell, you may choose both.\n• Add {R} for each card in target opponent's hand.\n• Exile the top three cards of your library. You may play them this turn."], "Kediss, Emberclaw Familiar": ["5600000066ffff4e", "Kediss, Emberclaw Familiar Whenever a commander you control deals combat damage to an opponent, it deals that much damage to each other opponent.\nPartner (You can have two commanders if both have partner.)"], "Krark, the Thumbless": ["000000007effff42", "Krark, the Thumbless Whenever you cast an instant or sorcery spell, flip a coin. If you lose the flip, return that spell to its owner's hand. If you win the flip, copy that spell, and you may choose new targets for the copy.\nPartner (You can have two commanders if both have partner.)"], "Lightning-Rig Crew": ["0e0c000002ffff7e", "Lightning-Rig Crew {T}: Lightning-Rig Crew deals 1 damage to each opponent.\nWhenever you cast a Pirate spell, untap Lightning-Rig Crew."], "Makeshift Munitions": ["000c0e0e0e7e7f00", "Makeshift Munitions {1}, Sacrifice an artifact or creature: Makeshift Munitions deals 1 damage to any target."], "Meteoric Mace": ["063e40021e7e7f00", "Meteoric Mace Equipped creature gets +4/+0 and has trample.\nEquip {4}\nCascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)"], "Port Razer": ["3e40400000ffff40", "Port Razer Whenever Port Razer deals combat damage to a player, untap each creature you control. After this combat phase, there is an additional combat phase.\nPort Razer can't attack a player it has already attacked this turn."], "Portent of Betrayal": ["1c0000022effff42", "Portent of Betrayal Gain control of target creature until end of turn. Untap that creature. It gains haste until end of turn. Scry 1. (Look at the top card of your library. You may put that card on the bottom of your library.)"], "Renegade Tactics": ["3cfc4800787f7f40", "Renegade Tactics Target creature can't block this turn.\nDraw a card."], "Ripscale Predator": ["0e00000038ffff6e", "Ripscale Predator Menace (This creature can't be blocked except by two or more creatures.)"], "Rograkh, Son of Rohgahh": ["5c703000087f7f02", "Rograkh, Son of Rohgahh First strike, menace, trample\nPartner (You can have two commanders if both have partner.)"], "Rummaging Goblin": ["1a00000000ffff62", "Rummaging Goblin {T}, Discard a card: Draw a card."], "Skyraker Giant": ["0e00000062ffff7e", "Skyraker Giant Reach"], "Souls Fire": ["1e6c280000ffff42", "Souls Fire Target creature you control deals damage equal to its power to any target."], "Soulfire Eruption": ["000844006e7f7f40", "Soulfire Eruption Choose any number of target creatures, planeswalkers, and/or players. For each of them, exile the top card of your library, then Soulfire Eruption deals damage equal to that card's converted mana cost to that permanent or player. You may play the exiled cards until the end of your next turn."], "Sparktongue Dragon": ["1c0000007effff7e", "Sparktongue Dragon Flying\nWhen Sparktongue Dragon enters the battlefield, you may pay {2}{R}. When you do, it deals 3 damage to any target."], "Stonefury": ["1c5830001effff02", "Stonefury Stonefury deals damage to target creature equal to the number of lands you control."], "Toggo, Goblin Weaponsmith": ["180646083a7f7f40", "Toggo, Goblin Weaponsmith Whenever a land enters the battlefield under your control, create a colorless Equipment artifact token named Rock with \"Equipped creature has '{1}, {T}, Sacrifice Rock: This creature deals 2 damage to any target'\" and equip {1}.\nPartner (You can have two commanders if both have partner.)"], "Undying Rage": ["1a324060607fff02", "Undying Rage Enchant creature\nEnchanted creature gets +2/+2 and can't block.\nWhen Undying Rage is put into a graveyard from the battlefield, return Undying Rage to its owner's hand."], "Valakut Invoker": ["18664262667e7f00", "Valakut Invoker {8}: Valakut Invoker deals 3 damage to any target."], "Volcanic Dragon": ["7e6000000effff46", "Volcanic Dragon Flying, haste"], "Volcanic Torrent": ["4c0004000effff7e", "Volcanic Torrent Cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)\nVolcanic Torrent deals X damage to each creature and planeswalker your opponents control, where X is the number of spells you've cast this turn."], "Vow of Lightning": ["1e0a000000ffff46", "Vow of Lightning Enchant creature\nEnchanted creature gets +2/+2, has first strike, and can't attack you or a planeswalker you control."], "Welding Sparks": ["0c6022001e7f7f00", "Welding Sparks Welding Sparks deals X damage to target creature, where X is 3 plus the number of artifacts you control."], "Wheel of Misfortune": ["1e1e0800067fff02", "Wheel of Misfortune Each player secretly chooses a number 0 or greater, then all players reveal those numbers simultaneously and determine the highest and lowest numbers revealed this way. Wheel of Misfortune deals damage equal to the highest number to each player who chose that number. Each player who didn't choose the lowest number discards their hand, then draws seven cards."], "Wild Celebrants": ["04080c003cffff42", "Wild Celebrants When Wild Celebrants enters the battlefield, you may destroy target artifact."], "Najeela, the Blade-Blossom": ["0c0002024effff42", "Najeela, the Blade-Blossom Whenever a Warrior attacks, you may have its controller create a 1/1 white Warrior creature token that's tapped and attacking.\n{W}{U}{B}{R}{G}: Untap all attacking creatures. They gain trample, lifelink, and haste until end of turn. After this phase, there is an additional combat phase. Activate this ability only during combat."], "Ambush Viper": ["587f7e665e1c1800", "Ambush Viper Flash\nDeathtouch"], "Anara, Wolvid Familiar": ["5e0000000affff42", "Anara, Wolvid Familiar As long as it's your turn, commanders you control have indestructible. (Effects that say \"destroy\" don't destroy them. A creature with indestructible can't be destroyed by damage.)\nPartner (You can have two commanders if both have partner.)"], "Ancient Animus": ["041a1a086e7f7f02", "Ancient Animus Put a +1/+1 counter on target creature you control if it's legendary. Then it fights target creature an opponent controls. (Each deals damage equal to its power to the other.)"], "Annoyed Altisaur": ["7e6e060000ffff00", "Annoyed Altisaur Reach, trample\nCascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)"], "Apex Devastator": ["7c580000787fff02", "Apex Devastator Cascade, cascade, cascade, cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order. Multiple instances of cascade each trigger separately.)"], "Armorcraft Judge": ["4c62600012ffff02", "Armorcraft Judge When Armorcraft Judge enters the battlefield, draw a card for each creature you control with a +1/+1 counter on it."], "Biowaste Blob": ["5e56000010ff7f02", "Biowaste Blob Oozes you control get +1/+1.\nAt the beginning of your upkeep, if you control a commander, create a token that's a copy of Biowaste Blob."], "Court of Bounty": ["5c08080060ffff42", "Court of Bounty When Court of Bounty enters the battlefield, you become the monarch.\nAt the beginning of your upkeep, you may put a land card from your hand onto the battlefield. If you're the monarch, instead you may put a creature or land card from your hand onto the battlefield."], "Crushing Vines": ["086064607c7f7f00", "Crushing Vines Choose one —\n• Destroy target creature with flying.\n• Destroy target artifact."], "Dawnglade Regent": ["0a041c081effff42", "Dawnglade Regent When Dawnglade Regent enters the battlefield, you become the monarch.\nAs long as you're the monarch, permanents you control have hexproof."], "Elvish Visionary": ["2e38140040ffff42", "Elvish Visionary When Elvish Visionary enters the battlefield, draw a card."], "Entourage of Trest": ["1e7e2000007f7f02", "Entourage of Trest When Entourage of Trest enters the battlefield, you become the monarch.\nEntourage of Trest can block an additional creature each combat as long as you're the monarch."], "Farhaven Elf": ["0c7e02007e7e7e00", "Farhaven Elf When Farhaven Elf enters the battlefield, you may search your library for a basic land card, put it onto the battlefield tapped, then shuffle your library."], "Fertilid": ["1c3c00003c7f7f02", "Fertilid Fertilid enters the battlefield with two +1/+1 counters on it.\n{1}{G}, Remove a +1/+1 counter from Fertilid: Target player searches their library for a basic land card, puts it onto the battlefield tapped, then shuffles their library."], "Fin-Clade Fugitives": ["1800400038ff7f02", "Fin-Clade Fugitives Fin-Clade Fugitives can't be blocked by creatures with power 2 or less.\nEncore {4}{G} ({4}{G}, Exile this card from your graveyard: For each opponent, create a token copy that attacks that opponent this turn if able. They gain haste. Sacrifice them at the beginning of the next end step. Activate only as a sorcery.)"], "Fyndhorn Elves": ["7e78000000ffff42", "Fyndhorn Elves {T}: Add {G}."], "Gift of Paradise": ["0e767030007e7e00", "Gift of Paradise Enchant land\nWhen Gift of Paradise enters the battlefield, you gain 3 life.\nEnchanted land has \"{T}: Add two mana of any one color.\""], "Gilanra, Caller of Wirewood": ["0e0000300effff42", "Gilanra, Caller of Wirewood {T}: Add {G}. When you spend this mana to cast a spell with converted mana cost 6 or greater, draw a card.\nPartner (You can have two commanders if both have partner.)"], "Halana, Kessig Ranger": ["1a262604407fff02", "Halana, Kessig Ranger Reach\nWhenever another creature enters the battlefield under your control, you may pay {2}. When you do, that creature deals damage equal to its power to target creature.\nPartner (You can have two commanders if both have partner.)"], "Hunters Insight": ["1c34000004ffff02", "Hunters Insight Choose target creature you control. Whenever that creature deals combat damage to a player or planeswalker this turn, draw that many cards."], "Ich-Tekik, Salvage Splicer": ["1c3406002e7f7f00", "Ich-Tekik, Salvage Splicer When Ich-Tekik, Salvage Splicer enters the battlefield, create a 3/3 colorless Golem artifact creature token.\nWhenever an artifact is put into a graveyard from the battlefield, put a +1/+1 counter on Ich-Tekik and a +1/+1 counter on each Golem you control.\nPartner (You can have two commanders if both have partner.)"], "Immaculate Magistrate": ["040606066effff02", "Immaculate Magistrate {T}: Put a +1/+1 counter on target creature for each Elf you control."], "Imperious Perfect": ["061c101032ff7f02", "Imperious Perfect Other Elves you control get +1/+1.\n{G}, {T}: Create a 1/1 green Elf Warrior creature token."], "Ivy Lane Denizen": ["043c02045e7f7e00", "Ivy Lane Denizen Whenever another green creature enters the battlefield under your control, put a +1/+1 counter on target creature."], "Kamahl, Heart of Krosa": ["5e73020000ffff42", "Kamahl, Heart of Krosa At the beginning of combat on your turn, creatures you control get +3/+3 and gain trample until end of turn.\n{1}{G}: Until end of turn, target land you control becomes a 1/1 Elemental creature with vigilance, indestructible, and haste. It's still a land.\nPartner (You can have two commanders if both have partner.)"], "Kamahls Will": ["1c36000008ffff42", "Kamahls Will Choose one. If you control a commander as you cast this spell, you may choose both.\n• Until end of turn, any number of target lands you control become 1/1 Elemental creatures with vigilance, indestructible, and haste. They're still lands.\n• Choose target creature you don't control. Each creature you control deals damage equal to its power to that creature."], "Kodama of the East Tree": ["1e7202023e7f7f00", "Kodama of the East Tree Reach\nWhenever another permanent enters the battlefield under your control, if it wasn't put onto the battlefield with this ability, you may put a permanent card with equal or lesser converted mana cost from your hand onto the battlefield.\nPartner (You can have two commanders if both have partner.)"], "Lifecrafters Gift": ["187c4000007f7f02", "Lifecrafters Gift Put a +1/+1 counter on target creature, then put a +1/+1 counter on each creature you control with a +1/+1 counter on it."], "Lys Alana Bowmaster": ["0c6e40001e7f7f00", "Lys Alana Bowmaster Reach\nWhenever you cast an Elf spell, you may have Lys Alana Bowmaster deal 2 damage to target creature with flying."], "Magus of the Order": ["060e0e00027f7f02", "Magus of the Order {G}, {T}, Sacrifice Magus of the Order and another green creature: Search your library for a green creature card, put it onto the battlefield, then shuffle your library."], "Molder Beast": ["1c30000026ffff62", "Molder Beast Trample\nWhenever an artifact is put into a graveyard from the battlefield, Molder Beast gets +2/+0 until end of turn."], "Monstrous Onslaught": ["1e7240007c7f7f02", "Monstrous Onslaught Monstrous Onslaught deals X damage divided as you choose among any number of target creatures, where X is the greatest power among creatures you control as you cast this spell."], "Natural Reclamation": ["004040307cffff02", "Natural Reclamation Cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)\nDestroy target artifact or enchantment."], "Numa, Joraga Chieftain": ["1e3c000018ffff62", "Numa, Joraga Chieftain At the beginning of combat on your turn, you may pay {X}{X}. When you do, distribute X +1/+1 counters among any number of target Elves.\nPartner (You can have two commanders if both have partner.)"], "Ordeal of Nylea": ["1c4e0202027fff02", "Ordeal of Nylea Enchant creature\nWhenever enchanted creature attacks, put a +1/+1 counter on it. Then if it has three or more +1/+1 counters on it, sacrifice Ordeal of Nylea.\nWhen you sacrifice Ordeal of Nylea, search your library for up to two basic land cards, put them onto the battlefield tapped, then shuffle your library."], "Reclamation Sage": ["1e1820101effff00", "Reclamation Sage When Reclamation Sage enters the battlefield, you may destroy target artifact or enchantment."], "Reshape the Earth": ["101000007affff02", "Reshape the Earth Search your library for up to ten land cards, put them onto the battlefield tapped, then shuffle your library."], "Rootweaver Druid": ["0e0e060020ffff00", "Rootweaver Druid When Rootweaver Druid enters the battlefield, each opponent may search their library for up to three basic land cards. They each put one of those cards onto the battlefield tapped under your control and the rest onto the battlefield tapped under their control. Then each player who searched their library this way shuffles it."], "Scaled Behemoth": ["0e0000006effff42", "Scaled Behemoth Hexproof (This creature can't be the target of spells or abilities your opponents control.)"], "Scrounging Bandar": ["7e60400000ffff02", "Scrounging Bandar Scrounging Bandar enters the battlefield with two +1/+1 counters on it.\nAt the beginning of your upkeep, you may move any number of +1/+1 counters from Scrounging Bandar onto another target creature."], "Sentinel Spider": ["0e7e6a00047e7e00", "Sentinel Spider Vigilance, reach"], "Sifter Wurm": ["6c4202067e7f7f02", "Sifter Wurm Trample\nWhen Sifter Wurm enters the battlefield, scry 3, then reveal the top card of your library. You gain life equal to that card's converted mana cost."], "Silverback Shaman": ["3e0810000affff02", "Silverback Shaman Trample\nWhen Silverback Shaman dies, draw a card."], "Slurrk, All-Ingesting": ["1c6c000002ffff02", "Slurrk, All-Ingesting Slurrk, All-Ingesting enters the battlefield with five +1/+1 counters on it.\nWhenever Slurrk or another creature you control dies, if it had a +1/+1 counter on it, put a +1/+1 counter on each creature you control that has a +1/+1 counter on it.\nPartner (You can have two commanders if both have partner.)"], "Souls Might": ["1c2828003cffff42", "Souls Might Put X +1/+1 counters on target creature, where X is that creature's power."], "Stingerfling Spider": ["007e7060727e7e00", "Stingerfling Spider Reach\nWhen Stingerfling Spider enters the battlefield, you may destroy target creature with flying."], "Strength of the Pack": ["1e1000043cffff42", "Strength of the Pack Put two +1/+1 counters on each creature you control."], "Sweet-Gum Recluse": ["7c0c00000effff62", "Sweet-Gum Recluse Flash\nCascade\nReach\nWhen Sweet-Gum Recluse enters the battlefield, put three +1/+1 counters on each of any number of target creatures that entered the battlefield this turn."], "Three Visits": ["0400020e3e7f7f02", "Three Visits Search your library for a Forest card, put that card onto the battlefield, then shuffle your library."], "Vow of Wildness": ["7c7870407c7f7f00", "Vow of Wildness Enchant creature\nEnchanted creature gets +3/+3, has trample, and can't attack you or a planeswalker you control."], "Wildheart Invoker": ["0e0e000060ffff42", "Wildheart Invoker {8}: Target creature gets +5/+5 and gains trample until end of turn."], "Wildsize": ["006060007e7f7f02", "Wildsize Target creature gets +2/+2 and gains trample until end of turn.\nDraw a card."], "Abomination of Llanowar": ["206e4e021a7e7e00", "Abomination of Llanowar Vigilance; menace (This creature can't be blocked except by two or more creatures.)\nAbomination of Llanowar's power and toughness are each equal to the number of Elves you control plus the number of Elf cards in your graveyard."], "Amareth, the Lustrous": ["1000000000ffff7e", "Amareth, the Lustrous Flying\nWhenever another permanent enters the battlefield under your control, look at the top card of your library. If it shares a card type with that permanent, you may reveal that card and put it into your hand."], "Araumi of the Dead Tide": ["0000023c3c7fff00", "Araumi of the Dead Tide {T}, Exile cards from your graveyard equal to the number of opponents you have: Target creature card in your graveyard gains encore until end of turn. The encore cost is equal to its mana cost. (Exile the creature card and pay its mana cost: For each opponent, create a token copy that attacks that opponent this turn if able. They gain haste. Sacrifice them at the beginning of the next end step. Activate only as a sorcery.)"], "Archelos, Lagoon Mystic": ["0066360008ffff00", "Archelos, Lagoon Mystic As long as Archelos, Lagoon Mystic is tapped, other permanents enter the battlefield tapped.\nAs long as Archelos is untapped, other permanents enter the battlefield untapped."], "Averna, the Chaos Bloom": ["1862200000ffff40", "Averna, the Chaos Bloom As you cascade, you may put a land card from among the exiled cards onto the battlefield tapped. (Do this after the last card is exiled but before deciding whether to cast a nonland card.)"], "Belbe, Corrupted Observer": ["162e080004ffff6e", "Belbe, Corrupted Observer At the beginning of each player's postcombat main phase, that player adds {C}{C} for each of your opponents who lost life this turn. (Damage causes loss of life.)"], "Bell Borca, Spectral Sergeant": ["0000000066ffff7e", "Bell Borca, Spectral Sergeant Note the converted mana cost of each card as it's put into exile.\nBell Borca, Spectral Sergeant's power is equal to the greatest number noted for it this turn.\nAt the beginning of your upkeep, exile the top card of your library. You may play that card this turn."], "Blim, Comedic Genius": ["1800c00000ffff0e", "Blim, Comedic Genius Flying\nWhenever Blim, Comedic Genius deals combat damage to a player, that player gains control of target permanent you control. Then each player loses life and discards cards equal to the number of permanents they control but don't own."], "Captain Vargus Wrath": ["1c4c200000ffff7e", "Captain Vargus Wrath Whenever Captain Vargus Wrath attacks, Pirates you control get +1/+1 until end of turn for each time you've cast a commander from the command zone this game."], "Colfenor, the Last Yew": ["1c264240607fff00", "Colfenor, the Last Yew Vigilance, reach\nWhenever Colfenor, the Last Yew or another creature you control dies, return up to one other target creature card with lesser toughness from your graveyard to your hand."], "Ghen, Arcanum Weaver": ["1800200000ffff66", "Ghen, Arcanum Weaver {R}{W}{B}, {T}, Sacrifice an enchantment: Return target enchantment card from your graveyard to the battlefield."], "Gnostro, Voice of the Crags": ["00001c5a4e7fff00", "Gnostro, Voice of the Crags {T}: Choose one. X is the number of spells you've cast this turn.\n• Scry X.\n• Gnostro, Voice of the Crags deals X damage to target creature.\n• You gain X life."], "Gor Muldrak, Amphinologist": ["1872430202ffff00", "Gor Muldrak, Amphinologist You and permanents you control have protection from Salamanders.\nAt the beginning of your end step, each player who controls the fewest creatures creates a 4/3 blue Salamander Warrior creature token."], "Hamza, Guardian of Arashin": ["1800000002ffff7e", "Hamza, Guardian of Arashin This spell costs {1} less to cast for each creature you control with a +1/+1 counter on it.\nCreature spells you cast cost {1} less to cast for each creature you control with a +1/+1 counter on it."], "Hans Eriksson": ["08724060607f7f00", "Hans Eriksson Whenever Hans Eriksson attacks, reveal the top card of your library. If it's a creature card, put it onto the battlefield tapped and attacking defending player or a planeswalker they control. Otherwise, put that card into your hand. When you put a creature card onto the battlefield this way, it fights Hans Eriksson."], "Imoti, Celebrant of Bounty": ["1c770002007f7f00", "Imoti, Celebrant of Bounty Cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)\nSpells you cast with converted mana cost 6 or greater have cascade."], "Jared Carthalion, True Heir": ["1818062000ffff02", "Jared Carthalion, True Heir When Jared Carthalion, True Heir enters the battlefield, target opponent becomes the monarch. You can't become the monarch this turn.\nIf damage would be dealt to Jared Carthalion while you're the monarch, prevent that damage and put that many +1/+1 counters on it."], "Juri, Master of the Revue": ["7840000002ffff7e", "Juri, Master of the Revue Whenever you sacrifice a permanent, put a +1/+1 counter on Juri, Master of the Revue.\nWhen Juri dies, it deals damage equal to its power to any target."], "Kangee, Sky Warden": ["1832400000ffff62", "Kangee, Sky Warden Flying, vigilance\nWhenever Kangee, Sky Warden attacks, attacking creatures with flying get +2/+0 until end of turn.\nWhenever Kangee blocks, blocking creatures with flying get +0/+2 until end of turn."], "Kwain, Itinerant Meddler": ["007e420e007e7f00", "Kwain, Itinerant Meddler {T}: Each player may draw a card, then each player who drew a card this way gains 1 life."], "Lathiel, the Bounteous Dawn": ["1000020010ffff72", "Lathiel, the Bounteous Dawn Lifelink\nAt the beginning of each end step, if you gained life this turn, distribute up to that many +1/+1 counters among any number of other target creatures."], "Liesa, Shroud of Dusk": ["00383e08007fff00", "Liesa, Shroud of Dusk Rather than pay {2} for each previous time you've cast this spell from the command zone this game, pay 2 life that many times.\nFlying, lifelink\nWhenever a player casts a spell, they lose 2 life."], "Nevinyrral, Urborg Tyrant": ["5878004062ffff60", "Nevinyrral, Urborg Tyrant Hexproof from artifacts, creatures, and enchantments\nWhen Nevinyrral, Urborg Tyrant enters the battlefield, create a tapped 2/2 black Zombie creature token for each creature that died this turn.\nWhen Nevinyrral dies, you may pay {1}. When you do, destroy all artifacts, creatures, and enchantments."], "Nymris, Oonas Trickster": ["1800000000ffff46", "Nymris, Oonas Trickster Flash\nFlying\nWhenever you cast your first spell during each opponent's turn, look at the top two cards of your library. Put one of those cards into your hand and the other into your graveyard."], "Obeka, Brute Chronologist": ["101e0600007fff00", "Obeka, Brute Chronologist {T}: The player whose turn it is may end the turn. (Exile all spells and abilities from the stack. The player whose turn it is discards down to their maximum hand size. Damage wears off, and \"this turn\" and \"until end of turn\" effects end.)"], "Reyav, Master Smith": ["18664640407f7f00", "Reyav, Master Smith Whenever a creature you control that's enchanted or equipped attacks, that creature gains double strike until end of turn."], "Thalisse, Reverent Medium": ["0c5a0000307f7f00", "Thalisse, Reverent Medium At the beginning of each end step, create X 1/1 white Spirit creature tokens with flying, where X is the number of tokens you created this turn."], "Tuya Bearclaw": ["181000020effff72", "Tuya Bearclaw Whenever Tuya Bearclaw attacks, it gets +X/+X until end of turn, where X is the greatest power among other creatures you control."], "Yurlok of Scorch Thrash": ["18664001027fff00", "Yurlok of Scorch Thrash Vigilance\nA player losing unspent mana causes that player to lose that much life.\n{1}, {T}: Each player adds {B}{R}{G}."], "Zara, Renegade Recruiter": ["183604000c7fff00", "Zara, Renegade Recruiter Flying\nWhenever Zara, Renegade Recruiter attacks, look at defending player's hand. You may put a creature card from it onto the battlefield under your control tapped and attacking that player or a planeswalker they control. Return that creature to its owner's hand at the beginning of the next end step."], "Akiri, Line-Slinger": ["105e0e0000ffff40", "Akiri, Line-Slinger First strike, vigilance\nAkiri, Line-Slinger gets +1/+0 for each artifact you control.\nPartner (You can have two commanders if both have partner.)"], "Brago, King Eternal": ["187f4f7f7c000000", "Brago, King Eternal Flying\nWhenever Brago, King Eternal deals combat damage to a player, exile any number of target nonland permanents you control, then return those cards to the battlefield under their owner's control."], "Bruse Tarl, Boorish Herder": ["f8fe0e0398fcb800", "Bruse Tarl, Boorish Herder Whenever Bruse Tarl, Boorish Herder enters the battlefield or attacks, target creature you control gains double strike and lifelink until end of turn.\nPartner (You can have two commanders if both have partner.)"], "Derevi, Empyrial Tactician": ["3c7fff73011d0800", "Derevi, Empyrial Tactician Flying\nWhenever Derevi, Empyrial Tactician enters the battlefield or a creature you control deals combat damage to a player, you may tap or untap target permanent.\n{1}{G}{W}{U}: Put Derevi onto the battlefield from the command zone."], "Ikra Shidiqi, the Usurper": ["78fb60cafc100000", "Ikra Shidiqi, the Usurper Menace\nWhenever a creature you control deals combat damage to a player, you gain life equal to that creature's toughness.\nPartner (You can have two commanders if both have partner.)"], "Ishai, Ojutai Dragonspeaker": ["7e1020407f7e7c1a", "Ishai, Ojutai Dragonspeaker Flying\nWhenever an opponent casts a spell, put a +1/+1 counter on Ishai, Ojutai Dragonspeaker.\nPartner (You can have two commanders if both have partner.)"], "Karador, Ghost Chieftain": ["7c23e379fabc9000", "Karador, Ghost Chieftain This spell costs {1} less to cast for each creature card in your graveyard.\nDuring each of your turns, you may cast a creature spell from your graveyard."], "Karametra, God of Harvests": ["1c0f4f0f2cfd1800", "Karametra, God of Harvests Indestructible\nAs long as your devotion to green and white is less than seven, Karametra isn't a creature.\nWhenever you cast a creature spell, you may search your library for a Forest or Plains card, put it onto the battlefield tapped, then shuffle your library."], "Kraum, Ludevics Opus": ["1cf7f7430c3c1800", "Kraum, Ludevics Opus Flying, haste\nWhenever an opponent casts their second spell each turn, draw a card.\nPartner (You can have two commanders if both have partner.)"], "Kydele, Chosen of Kruphix": ["7a7e76407cfc3012", "Kydele, Chosen of Kruphix {T}: Add {C} for each card you've drawn this turn.\nPartner (You can have two commanders if both have partner.)"], "Ludevic, Necro-Alchemist": ["7c08487a7e7e7802", "Ludevic, Necro-Alchemist At the beginning of each player's end step, that player may draw a card if a player other than you lost life this turn.\nPartner (You can have two commanders if both have partner.)"], "Maelstrom Wanderer": ["7a034c6efefc7012", "Maelstrom Wanderer Creatures you control have haste.\nCascade, cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order. Then do it again.)"], "Marath, Will of the Wild": ["1830f6fe3c180000", "Marath, Will of the Wild Marath, Will of the Wild enters the battlefield with a number of +1/+1 counters on it equal to the amount of mana spent to cast it.\n{X}, Remove X +1/+1 counters from Marath: Choose one —\n• Put X +1/+1 counters on target creature. X can't be 0.\n• Marath deals X damage to any target. X can't be 0.\n• Create an X/X green Elemental creature token. X can't be 0."], "Muldrotha, the Gravetide": ["ffff04003dff9802", "Muldrotha, the Gravetide During each of your turns, you may play a land and cast a permanent spell of each permanent type from your graveyard. (If a card has multiple permanent types, choose one as you play it.)"], "Nekusar, the Mindrazer": ["78ffffe7003c0000", "Nekusar, the Mindrazer At the beginning of each player's draw step, that player draws an additional card.\nWhenever an opponent draws a card, Nekusar, the Mindrazer deals 1 damage to that player."], "Prossh, Skyraider of Kher": ["7c38e0c000ff9902", "Prossh, Skyraider of Kher When you cast this spell, create X 0/1 red Kobold creature tokens named Kobolds of Kher Keep, where X is the amount of mana spent to cast it.\nFlying\nSacrifice another creature: Prossh, Skyraider of Kher gets +1/+0 until end of turn."], "Queen Marchesa": ["1c0f63781cfc1000", "Queen Marchesa Deathtouch, haste\nWhen Queen Marchesa enters the battlefield, you become the monarch.\nAt the beginning of your upkeep, if an opponent is the monarch, create a 1/1 black Assassin creature token with deathtouch and haste."], "Rakdos, Lord of Riots": ["ff818181fdffff3a", "Rakdos, Lord of Riots You can't cast this spell unless an opponent lost life this turn.\nFlying, trample\nCreature spells you cast cost {1} less to cast for each 1 life your opponents have lost this turn."], "Ravos, Soultender": ["7c34363c3c787802", "Ravos, Soultender Flying\nOther creatures you control get +1/+1.\nAt the beginning of your upkeep, you may return target creature card from your graveyard to your hand.\nPartner (You can have two commanders if both have partner.)"], "Reyhan, Last of the Abzan": ["f8a8248cfefcfc12", "Reyhan, Last of the Abzan Reyhan, Last of the Abzan enters the battlefield with three +1/+1 counters on it.\nWhenever a creature you control dies or is put into the command zone, if it had one or more +1/+1 counters on it, you may put that many +1/+1 counters on target creature.\nPartner (You can have two commanders if both have partner.)"], "Sidar Kondo of Jamuraa": ["7a7ec6407a7e7c02", "Sidar Kondo of Jamuraa Flanking (Whenever a creature without flanking blocks this creature, the blocking creature gets -1/-1 until end of turn.)\nCreatures your opponents control without flying or reach can't block creatures with power 2 or less.\nPartner (You can have two commanders if both have partner.)"], "Silas Renn, Seeker Adept": ["187f673f3f0c0000", "Silas Renn, Seeker Adept Deathtouch\nWhenever Silas Renn, Seeker Adept deals combat damage to a player, choose target artifact card in your graveyard. You may cast that card this turn.\nPartner (You can have two commanders if both have partner.)"], "Tana, the Bloodsower": ["7c1c0f863cffbc00", "Tana, the Bloodsower Trample\nWhenever Tana, the Bloodsower deals combat damage to a player, create that many 1/1 green Saproling creature tokens.\nPartner (You can have two commanders if both have partner.)"], "Thrasios, Triton Hero": ["7eff4200087c1c02", "Thrasios, Triton Hero {4}: Scry 1, then reveal the top card of your library. If it's a land card, put it onto the battlefield tapped. Otherwise, draw a card.\nPartner (You can have two commanders if both have partner.)"], "Tymna the Weaver": ["787e02067e7c3800", "Tymna the Weaver Lifelink\nAt the beginning of your postcombat main phase, you may pay X life, where X is the number of opponents that were dealt combat damage this turn. If you do, draw X cards.\nPartner (You can have two commanders if both have partner.)"], "Vial Smasher the Fierce": ["18f8ecfefebc9800", "Vial Smasher the Fierce Whenever you cast your first spell each turn, choose an opponent at random. Vial Smasher the Fierce deals damage equal to that spell's converted mana cost to that player or a planeswalker that player controls.\nPartner (You can have two commanders if both have partner.)"], "Xenagos, God of Revels": ["7ef87800087c7812", "Xenagos, God of Revels Indestructible\nAs long as your devotion to red and green is less than seven, Xenagos isn't a creature.\nAt the beginning of combat on your turn, another target creature you control gains haste and gets +X/+X until end of turn, where X is that creature's power."], "Yuriko, the Tigers Shadow": ["180f6e38383e1c00", "Yuriko, the Tigers Shadow Commander ninjutsu {U}{B} ({U}{B}, Return an unblocked attacker you control to hand: Put this card onto the battlefield from your hand or the command zone tapped and attacking.)\nWhenever a Ninja you control deals combat damage to a player, reveal the top card of your library and put that card into your hand. Each opponent loses life equal to that card's converted mana cost."], "Zedruu the Greathearted": ["7cfaf0203c7c3c00", "Zedruu the Greathearted At the beginning of your upkeep, you gain X life and draw X cards, where X is the number of permanents you own that your opponents control.\n{U}{R}{W}: Target opponent gains control of target permanent you control."], "Zur the Enchanter": ["78fffec46c3c0000", "Zur the Enchanter Flying\nWhenever Zur the Enchanter attacks, you may search your library for an enchantment card with converted mana cost 3 or less and put it onto the battlefield. If you do, shuffle your library."], "The Prismatic Piper": ["18e0c4ef7f181000", "The Prismatic Piper If The Prismatic Piper is your commander, choose a color before the game begins. The Prismatic Piper is the chosen color.\nPartner (You can have two commanders if both have partner.)"], "Amorphous Axe": ["7c70301c0f7f7e02", "Amorphous Axe Equipped creature gets +3/+0 and is every creature type.\nEquip {3} ({3}: Attach to target creature you control. Equip only as a sorcery.)"], "Angelic Armaments": ["1e0602000cffff00", "Angelic Armaments Equipped creature gets +2/+2, has flying, and is a white Angel in addition to its other colors and types.\nEquip {4} ({4}: Attach to target creature you control. Equip only as a sorcery.)"], "Arcane Signet": ["4e40264078ffff00", "Arcane Signet {T}: Add one mana of any color in your commander's color identity."], "Armillary Sphere": ["5e0020003effff42", "Armillary Sphere {2}, {T}, Sacrifice Armillary Sphere: Search your library for up to two basic land cards, reveal them, put them into your hand, then shuffle your library."], "Armory of Iroas": ["7e0000007cffff7e", "Armory of Iroas Whenever equipped creature attacks, put a +1/+1 counter on it.\nEquip {2} ({2}: Attach to target creature you control. Equip only as a sorcery.)"], "Bladegriff Prototype": ["7e7010307e7fff00", "Bladegriff Prototype Flying\nWhenever Bladegriff Prototype deals combat damage to a player, destroy target nonland permanent of that player's choice that one of your opponents controls."], "Brass Herald": ["7e72020000ffff00", "Brass Herald As Brass Herald enters the battlefield, choose a creature type.\nWhen Brass Herald enters the battlefield, reveal the top four cards of your library. Put all creature cards of the chosen type revealed this way into your hand and the rest on the bottom of your library in any order.\nCreatures of the chosen type get +1/+1."], "Burnished Hart": ["1e0000060e7f7f00", "Burnished Hart {3}, Sacrifice Burnished Hart: Search your library for up to two basic land cards, put them onto the battlefield tapped, then shuffle your library."], "Charcoal Diamond": ["1e7e6600107e7e00", "Charcoal Diamond Charcoal Diamond enters the battlefield tapped.\n{T}: Add {B}."], "Codex Shredder": ["3e2c00003cffff40", "Codex Shredder {T}: Target player mills a card. (They put the top card of their library into their graveyard.)\n{5}, {T}, Sacrifice Codex Shredder: Return target card from your graveyard to your hand."], "Commanders Plate": ["1e3e060404ff7f00", "Commanders Plate Equipped creature gets +3/+3 and has protection from each color that's not in your commander's color identity.\nEquip commander {3}\nEquip {5}"], "Commanders Sphere": ["007e46464e7e7e00", "Commanders Sphere {T}: Add one mana of any color in your commander's color identity.\nSacrifice Commander's Sphere: Draw a card."], "Dreamstone Hedron": ["46001800ffffff76", "Dreamstone Hedron {T}: Add {C}{C}{C}.\n{3}, {T}, Sacrifice Dreamstone Hedron: Draw three cards."], "Filigree Familiar": ["1e0018007effff62", "Filigree Familiar When Filigree Familiar enters the battlefield, you gain 2 life.\nWhen Filigree Familiar dies, draw a card."], "Fire Diamond": ["1e020207767fff00", "Fire Diamond Fire Diamond enters the battlefield tapped.\n{T}: Add {R}."], "Foundry Inspector": ["3e18000008ffff00", "Foundry Inspector Artifact spells you cast cost {1} less to cast."], "Golem Artisan": ["2e0020001effff02", "Golem Artisan {2}: Target artifact creature gets +1/+1 until end of turn.\n{2}: Target artifact creature gains your choice of flying, trample, or haste until end of turn."], "Grafted Wargear": ["7e78080000ffff42", "Grafted Wargear Equipped creature gets +3/+2.\nWhenever Grafted Wargear becomes unattached from a permanent, sacrifice that permanent.\nEquip {0} ({0}: Attach to target creature you control. Equip only as a sorcery.)"], "Haunted Cloak": ["7e0e000076ffff00", "Haunted Cloak Equipped creature has vigilance, trample, and haste.\nEquip {1} ({1}: Attach to target creature you control. Equip only as a sorcery.)"], "Heros Blade": ["7e1010000effff02", "Heros Blade Equipped creature gets +3/+2.\nWhenever a legendary creature enters the battlefield under your control, you may attach Hero's Blade to it.\nEquip {4} ({4}: Attach to target creature you control. Equip only as a sorcery.)"], "Horizon Stone": ["7e04003074ffff00", "Horizon Stone If you would lose unspent mana, that mana becomes colorless instead."], "Howling Golem": ["7e000000ffffff7e", "Howling Golem Whenever Howling Golem attacks or blocks, each player draws a card."], "Ingenuity Engine": ["3e6f000002ffff00", "Ingenuity Engine Cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)\n{1}, {T}, Sacrifice an artifact: Return target artifact you control to its owner's hand."], "Jalum Tome": ["6e7e240020ffff00", "Jalum Tome {2}, {T}: Draw a card, then discard a card."], "Jeweled Lotus": ["7e5a01007effff00", "Jeweled Lotus {T}, Sacrifice Jeweled Lotus: Add three mana of any one color. Spend this mana only to cast your commander."], "Loreseekers Stone": ["5e00380000ffff42", "Loreseekers Stone {3}, {T}: Draw three cards. This ability costs {1} more to activate for each card in your hand."], "Lumengrid Gargoyle": ["0c181c1818ffff00", "Lumengrid Gargoyle Flying"], "Maelstrom Colossus": ["006062767e7e7e00", "Maelstrom Colossus Cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)"], "Marble Diamond": ["1e0061080affff00", "Marble Diamond Marble Diamond enters the battlefield tapped.\n{T}: Add {W}."], "Mask of Memory": ["1e7e42061e7e7e00", "Mask of Memory Whenever equipped creature deals combat damage to a player, you may draw two cards. If you do, discard a card.\nEquip {1} ({1}: Attach to target creature you control. Equip only as a sorcery.)"], "Meteor Golem": ["081018107e7f7f00", "Meteor Golem When Meteor Golem enters the battlefield, destroy target nonland permanent an opponent controls."], "Mindless Automaton": ["5e63060004ffff42", "Mindless Automaton Mindless Automaton enters the battlefield with two +1/+1 counters on it.\n{1}, Discard a card: Put a +1/+1 counter on Mindless Automaton.\nRemove two +1/+1 counters from Mindless Automaton: Draw a card."], "Moss Diamond": ["0e1e000012ffff00", "Moss Diamond Moss Diamond enters the battlefield tapped.\n{T}: Add {G}."], "Nevinyrrals Disk": ["1e00181020ffff40", "Nevinyrrals Disk Nevinyrral's Disk enters the battlefield tapped.\n{1}, {T}: Destroy all artifacts, creatures, and enchantments."], "Pennon Blade": ["7e0000003cffff00", "Pennon Blade Equipped creature gets +1/+1 for each creature you control.\nEquip {4} ({4}: Attach to target creature you control. Equip only as a sorcery.)"], "Perilous Myr": ["5e0002004fffff00", "Perilous Myr When Perilous Myr dies, it deals 2 damage to any target."], "Phyrexian Triniform": ["1e40400202ffff00", "Phyrexian Triniform When Phyrexian Triniform dies, create three 3/3 colorless Golem artifact creature tokens.\nEncore {12} ({12}, Exile this card from your graveyard: For each opponent, create a token copy that attacks that opponent this turn if able. They gain haste. Sacrifice them at the beginning of the next end step. Activate only as a sorcery.)"], "Pilgrims Eye": ["7e00000030ffff72", "Pilgrims Eye Flying\nWhen Pilgrim's Eye enters the battlefield, you may search your library for a basic land card, reveal it, put it into your hand, then shuffle your library."], "Pirates Cutlass": ["7e5806101e7f7f00", "Pirates Cutlass When Pirate's Cutlass enters the battlefield, attach it to target Pirate you control.\nEquipped creature gets +2/+1.\nEquip {2} ({2}: Attach to target creature you control. Equip only as a sorcery.)"], "Prophetic Prism": ["1e7f1e00007f7f00", "Prophetic Prism When Prophetic Prism enters the battlefield, draw a card.\n{1}, {T}: Add one mana of any color."], "Rings of Brighthearth": ["0e0c2e04087fff00", "Rings of Brighthearth Whenever you activate an ability, if it isn't a mana ability, you may pay {2}. If you do, copy that ability. You may choose new targets for the copy."], "Sandstone Oracle": ["0e0000007effff00", "Sandstone Oracle Flying\nWhen Sandstone Oracle enters the battlefield, choose an opponent. If that player has more cards in hand than you, draw cards equal to the difference."], "Scroll Rack": ["7e0010004effff7e", "Scroll Rack {1}, {T}: Exile any number of cards from your hand face down. Put that many cards from the top of your library into your hand. Then look at the exiled cards and put them on top of your library in any order."], "Seers Lantern": ["7e0000007effff62", "Seers Lantern {T}: Add {C}.\n{2}, {T}: Scry 1. (Look at the top card of your library. You may put that card on the bottom of your library.)"], "Shimmer Myr": ["7e0008007effff7e", "Shimmer Myr Flash\nYou may cast artifact spells as though they had flash."], "Sisays Ring": ["7e78000000ffff42", "Sisays Ring {T}: Add {C}{C}."], "Sky Diamond": ["1c1010383cffff00", "Sky Diamond Sky Diamond enters the battlefield tapped.\n{T}: Add {U}."], "Spectral Searchlight": ["1e586822367f7f00", "Spectral Searchlight {T}: Choose a player. That player adds one mana of any color they choose."], "Staff of Domination": ["0c00004666ffff00", "Staff of Domination {1}: Untap Staff of Domination.\n{2}, {T}: You gain 1 life.\n{3}, {T}: Untap target creature.\n{4}, {T}: Tap target creature.\n{5}, {T}: Draw a card."], "Staunch Throneguard": ["0e326008787f7f00", "Staunch Throneguard Vigilance\nWhen Staunch Throneguard enters the battlefield, you become the monarch."], "Sunset Pyramid": ["3e7c6820007f7f00", "Sunset Pyramid Sunset Pyramid enters the battlefield with three brick counters on it.\n{2}, {T}, Remove a brick counter from Sunset Pyramid: Draw a card.\n{2}, {T}: Scry 1."], "Thought Vessel": ["0e66460030ffff00", "Thought Vessel You have no maximum hand size.\n{T}: Add {C}."], "Universal Solvent": ["1e0442003cffff40", "Universal Solvent {7}, {T}, Sacrifice Universal Solvent: Destroy target permanent."], "Workshop Assistant": ["7e0000007cffff76", "Workshop Assistant When Workshop Assistant dies, return another target artifact card from your graveyard to your hand."], "Ramos, Dragon Engine": ["3e3404041effff02", "Ramos, Dragon Engine Flying\nWhenever you cast a spell, put a +1/+1 counter on Ramos, Dragon Engine for each of that spell's colors.\nRemove five +1/+1 counters from Ramos: Add {W}{W}{U}{U}{B}{B}{R}{R}{G}{G}. Activate this ability only once each turn."], "Command Beacon": ["78ffff6e30180000", "Command Beacon {T}: Add {C}.\n{T}, Sacrifice Command Beacon: Put your commander into your hand from the command zone."], "Command Tower": ["7e3c100010ffff02", "Command Tower {T}: Add one mana of any color in your commander's color identity."], "Guildless Commons": ["3e7c400010ffff42", "Guildless Commons Guildless Commons enters the battlefield tapped.\nWhen Guildless Commons enters the battlefield, return a land you control to its owner's hand.\n{T}: Add {C}{C}."], "Opal Palace": ["0e7e6c007e7e7e00", "Opal Palace {T}: Add {C}.\n{1}, {T}: Add one mana of any color in your commander's color identity. If you spend this mana to cast your commander, it enters the battlefield with a number of additional +1/+1 counters on it equal to the number of times it's been cast from the command zone this game."], "Path of Ancestry": ["1e00700000ffff46", "Path of Ancestry Path of Ancestry enters the battlefield tapped.\n{T}: Add one mana of any color in your commander's color identity. When that mana is spent to cast a creature spell that shares a creature type with your commander, scry 1. (Look at the top card of your library. You may put that card on the bottom of your library.)"], "Rejuvenating Springs": ["1e7e10003e7f7f00", "Rejuvenating Springs Rejuvenating Springs enters the battlefield tapped unless you have two or more opponents.\n{T}: Add {G} or {U}."], "Rupture Spire": ["067e3c041e7e7e00", "Rupture Spire Rupture Spire enters the battlefield tapped.\nWhen Rupture Spire enters the battlefield, sacrifice it unless you pay {1}.\n{T}: Add one mana of any color."], "Spectator Seating": ["1e3e1800007f7f42", "Spectator Seating Spectator Seating enters the battlefield tapped unless you have two or more opponents.\n{T}: Add {R} or {W}."], "Terramorphic Expanse": ["7e3e0e00067f7f00", "Terramorphic Expanse {T}, Sacrifice Terramorphic Expanse: Search your library for a basic land card, put it onto the battlefield tapped, then shuffle your library."], "Training Center": ["663838107cffff00", "Training Center Training Center enters the battlefield tapped unless you have two or more opponents.\n{T}: Add {U} or {R}."], "Undergrowth Stadium": ["4e003c3c7e7e7e00", "Undergrowth Stadium Undergrowth Stadium enters the battlefield tapped unless you have two or more opponents.\n{T}: Add {B} or {G}."], "Vault of Champions": ["7e7e0000107f7f00", "Vault of Champions Vault of Champions enters the battlefield tapped unless you have two or more opponents.\n{T}: Add {W} or {B}."], "War Room": ["7e0002227efefe60", "War Room {T}: Add {C}.\n{3}, {T}, Pay life equal to the number of colors in your commanders' color identity: Draw a card."]}