{"Abzan Battle Priest": ["7e7e420006ffff00", "Abzan Battle Priest Outlast {W} ({W}, {T}: Put a +1/+1 counter on this creature. Outlast only as a sorcery.)\nEach creature you control with a +1/+1 counter on it has lifelink."], "Abzan Falconer": ["7e01000006ffff76", "Abzan Falconer Outlast {W} ({W}, {T}: Put a +1/+1 counter on this creature. Outlast only as a sorcery.)\nEach creature you control with a +1/+1 counter on it has flying."], "Ainok Bond-Kin": ["7e06600000ffff02", "Ainok Bond-Kin Outlast {1}{W} ({1}{W}, {T}: Put a +1/+1 counter on this creature. Outlast only as a sorcery.)\nEach creature you control with a +1/+1 counter on it has first strike."], "Ajanis Pridemate": ["7e3000000affff42", "Ajanis Pridemate Whenever you gain life, put a +1/+1 counter on Ajani's Pridemate."], "Angel of Mercy": ["5e76660040ff7f00", "Angel of Mercy Flying\nWhen Angel of Mercy enters the battlefield, you gain 3 life."], "Angelic Accord": ["7e7820001effff00", "Angelic Accord At the beginning of each end step, if you gained 4 or more life this turn, create a 4/4 white Angel creature token with flying."], "Archangel of Thune": ["5e07030204ffff02", "Archangel of Thune Flying\nLifelink (Damage dealt by this creature also causes you to gain that much life.)\nWhenever you gain life, put a +1/+1 counter on each creature you control."], "Auriok Champion": ["5e08340000ffff42", "Auriok Champion Protection from black and from red\nWhenever another creature enters the battlefield, you may gain 1 life."], "Austere Command": ["4c40201e3cffff00", "Austere Command Choose two —\n• Destroy all artifacts.\n• Destroy all enchantments.\n• Destroy all creatures with converted mana cost 3 or less.\n• Destroy all creatures with converted mana cost 4 or greater."], "Avacyn, Angel of Hope": ["5c18020e4affff00", "Avacyn, Angel of Hope Flying, vigilance, indestructible\nOther permanents you control have indestructible."], "Benevolent Ancestor": ["1e1800003effff02", "Benevolent Ancestor Defender (This creature can't attack.)\n{T}: Prevent the next 1 damage that would be dealt to any target this turn."], "Blinding Mage": ["7e7c380000ffff00", "Blinding Mage {W}, {T}: Tap target creature."], "Burrenton Forge-Tender": ["7e0000003effff42", "Burrenton Forge-Tender Protection from red\nSacrifice Burrenton Forge-Tender: Prevent all damage a red source of your choice would deal this turn."], "Disenchant": ["1e0c08007e7f7f00", "Disenchant Destroy target artifact or enchantment."], "Doomed Traveler": ["7e1c000004ffff02", "Doomed Traveler When Doomed Traveler dies, create a 1/1 white Spirit creature token with flying."], "Dragon Bell Monk": ["7ee020003cffff02", "Dragon Bell Monk Vigilance\nProwess (Whenever you cast a noncreature spell, this creature gets +1/+1 until end of turn.)"], "Elesh Norn, Grand Cenobite": ["40787070707f7f00", "Elesh Norn, Grand Cenobite Vigilance\nOther creatures you control get +2/+2.\nCreatures your opponents control get -2/-2."], "Emerge Unscathed": ["4e3c10007effff00", "Emerge Unscathed Target creature you control gains protection from the color of your choice until end of turn.\nRebound (If you cast this spell from your hand, exile it as it resolves. At the beginning of your next upkeep, you may cast this card from exile without paying its mana cost.)"], "Emeria Angel": ["180002007effff00", "Emeria Angel Flying\nLandfall — Whenever a land enters the battlefield under your control, you may create a 1/1 white Bird creature token with flying."], "Great Teachers Decree": ["5e6c20007e7f7f00", "Great Teachers Decree Creatures you control get +2/+1 until end of turn.\nRebound (If you cast this spell from your hand, exile it as it resolves. At the beginning of your next upkeep, you may cast this card from exile without paying its mana cost.)"], "Guard Duty": ["7e0800007effff00", "Guard Duty Enchant creature\nEnchanted creature has defender."], "Guided Strike": ["5e7e0200087f7f00", "Guided Strike Target creature gets +1/+0 and gains first strike until end of turn.\nDraw a card."], "Infantry Veteran": ["7ee7430040ffff00", "Infantry Veteran {T}: Target attacking creature gets +1/+1 until end of turn."], "Ionas Judgment": ["0e3a7e0e0c7f7f00", "Ionas Judgment Exile target creature or enchantment."], "Path of Bravery": ["7e0020000effff40", "Path of Bravery As long as your life total is greater than or equal to your starting life total, creatures you control get +1/+1.\nWhenever one or more creatures you control attack, you gain life equal to the number of attacking creatures."], "Pentarch Ward": ["1e6642006e7f7f00", "Pentarch Ward Enchant creature\nAs Pentarch Ward enters the battlefield, choose a color.\nWhen Pentarch Ward enters the battlefield, draw a card.\nEnchanted creature has protection from the chosen color. This effect doesn't remove Pentarch Ward."], "Restoration Angel": ["084e5a02067f7f00", "Restoration Angel Flash\nFlying\nWhen Restoration Angel enters the battlefield, you may exile target non-Angel creature you control, then return that card to the battlefield under your control."], "Seeker of the Way": ["7e720040627f7f00", "Seeker of the Way Prowess (Whenever you cast a noncreature spell, this creature gets +1/+1 until end of turn.)\nWhenever you cast a noncreature spell, Seeker of the Way gains lifelink until end of turn."], "Serra Angel": ["5c3c00001cffff00", "Serra Angel Flying, vigilance"], "Serra Ascendant": ["1c3c7e00187f7f00", "Serra Ascendant Lifelink (Damage dealt by this creature also causes you to gain that much life.)\nAs long as you have 30 or more life, Serra Ascendant gets +5/+5 and has flying."], "Stalwart Aven": ["7e0002036effff02", "Stalwart Aven Flying (This creature can't be blocked except by creatures with flying or reach.)\nRenown 1 (When this creature deals combat damage to a player, if it isn't renowned, put a +1/+1 counter on it and it becomes renowned.)"], "Student of Ojutai": ["7e76020072ffff00", "Student of Ojutai Whenever you cast a noncreature spell, you gain 2 life."], "Survival Cache": ["7e0c00007effff7e", "Survival Cache You gain 2 life. Then if you have more life than an opponent, draw a card.\nRebound (If you cast this spell from your hand, exile it as it resolves. At the beginning of your next upkeep, you may cast this card from exile without paying its mana cost.)"], "Sustainer of the Realm": ["005a60607e7f7f00", "Sustainer of the Realm Flying\nWhenever Sustainer of the Realm blocks, it gets +0/+2 until end of turn."], "Swords to Plowshares": ["7e3c00005effff00", "Swords to Plowshares Exile target creature. Its controller gains life equal to its power."], "Topan Freeblade": ["4e7e4642487e7e00", "Topan Freeblade Vigilance (Attacking doesn't cause this creature to tap.)\nRenown 1 (When this creature deals combat damage to a player, if it isn't renowned, put a +1/+1 counter on it and it becomes renowned.)"], "Wing Shards": ["1c7e6e0e7e7e7f00", "Wing Shards Target player sacrifices an attacking creature.\nStorm (When you cast this spell, copy it for each spell cast before it this turn. You may choose new targets for the copies.)"], "Yosei, the Morning Star": ["5c0008003effff02", "Yosei, the Morning Star Flying\nWhen Yosei, the Morning Star dies, target player skips their next untap step. Tap up to five target permanents that player controls."], "Aetherize": ["3c703e044e7f7f00", "Aetherize Return all attacking creatures to their owner's hand."], "Amass the Components": ["1e04000034ffff62", "Amass the Components Draw three cards, then put a card from your hand on the bottom of your library."], "Ancestral Vision": ["0e3f7f00007f7f00", "Ancestral Vision Suspend 4—{U} (Rather than cast this card from your hand, pay {U} and exile it with four time counters on it. At the beginning of your upkeep, remove a time counter. When the last is removed, cast it without paying its mana cost.)\nTarget player draws three cards."], "Bewilder": ["3c7e4400767f7f00", "Bewilder Target creature gets -3/-0 until end of turn.\nDraw a card."], "Cephalid Broker": ["0e464600427f7f00", "Cephalid Broker {T}: Target player draws two cards, then discards two cards."], "Claustrophobia": ["7e0808000cffff62", "Claustrophobia Enchant creature\nWhen Claustrophobia enters the battlefield, tap enchanted creature.\nEnchanted creature doesn't untap during its controller's untap step."], "Condescend": ["5e02020078ffff40", "Condescend Counter target spell unless its controller pays {X}. Scry 2. (Look at the top two cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.)"], "Consecrated Sphinx": ["0c1040007effff00", "Consecrated Sphinx Flying\nWhenever an opponent draws a card, you may draw two cards."], "Cryptic Command": ["083c7e3c1c7f7f00", "Cryptic Command Choose two —\n• Counter target spell.\n• Return target permanent to its owner's hand.\n• Tap all creatures your opponents control.\n• Draw a card."], "Day of the Dragons": ["006646267e7e7f00", "Day of the Dragons When Day of the Dragons enters the battlefield, exile all creatures you control. Then create that many 5/5 red Dragon creature tokens with flying.\nWhen Day of the Dragons leaves the battlefield, sacrifice all Dragons you control. Then return the exiled cards to the battlefield under your control."], "Diminish": ["1e0010007effff40", "Diminish Target creature has base power and toughness 1/1 until end of turn."], "Dissolve": ["18521e10607f7f00", "Dissolve Counter target spell. Scry 1. (Look at the top card of your library. You may put that card on the bottom of your library.)"], "Distortion Strike": ["7e7e4a0000ffff00", "Distortion Strike Target creature gets +1/+0 until end of turn and can't be blocked this turn.\nRebound (If you cast this spell from your hand, exile it as it resolves. At the beginning of your next upkeep, you may cast this card from exile without paying its mana cost.)"], "Doorkeeper": ["1e0000007effff42", "Doorkeeper Defender\n{2}{U}, {T}: Target player mills X cards, where X is the number of creatures with defender you control."], "Elusive Spellfist": ["5e00206826ffff42", "Elusive Spellfist Whenever you cast a noncreature spell, Elusive Spellfist gets +1/+0 until end of turn and can't be blocked this turn."], "Flusterstorm": ["0e024060787fff00", "Flusterstorm Counter target instant or sorcery spell unless its controller pays {1}.\nStorm (When you cast this spell, copy it for each spell cast before it this turn. You may choose new targets for the copies.)"], "Fog Bank": ["1c3e3c0000ffff02", "Fog Bank Defender, flying\nPrevent all combat damage that would be dealt to and dealt by Fog Bank."], "Frost Lynx": ["5e0000007effff46", "Frost Lynx When Frost Lynx enters the battlefield, tap target creature an opponent controls. That creature doesn't untap during its controller's next untap step."], "Illusory Ambusher": ["187e7860687f7f00", "Illusory Ambusher Flash (You may cast this spell any time you could cast an instant.)\nWhenever Illusory Ambusher is dealt damage, draw that many cards."], "Illusory Angel": ["5c0008444cffff02", "Illusory Angel Cast this spell only if you've cast another spell this turn.\nFlying"], "Jaces Phantasm": ["00307830327f7f00", "Jaces Phantasm Flying\nJace's Phantasm gets +4/+4 as long as an opponent has ten or more cards in their graveyard."], "Jhessian Thief": ["1e7a4042267f7f00", "Jhessian Thief Prowess (Whenever you cast a noncreature spell, this creature gets +1/+1 until end of turn.)\nWhenever Jhessian Thief deals combat damage to a player, draw a card."], "Jin-Gitaxias, Core Augur": ["7e70400000ffff02", "Jin-Gitaxias, Core Augur Flash\nAt the beginning of your end step, draw seven cards.\nEach opponent's maximum hand size is reduced by seven."], "Keiga, the Tide Star": ["0e0000607e7fff00", "Keiga, the Tide Star Flying\nWhen Keiga, the Tide Star dies, gain control of target creature."], "Mahamoti Djinn": ["1e0000101cffff62", "Mahamoti Djinn Flying (This creature can't be blocked except by creatures with flying or reach.)"], "Mana Drain": ["7e0000005effff62", "Mana Drain Counter target spell. At the beginning of your next main phase, add an amount of {C} equal to that spell's converted mana cost."], "Mana Leak": ["3e1800003effff66", "Mana Leak Counter target spell unless its controller pays {3}."], "Mnemonic Wall": ["0e7f7e00007f7f00", "Mnemonic Wall Defender\nWhen Mnemonic Wall enters the battlefield, you may return target instant or sorcery card from your graveyard to your hand."], "Ojutais Breath": ["00025a7e7e7e7e00", "Ojutais Breath Tap target creature. It doesn't untap during its controller's next untap step.\nRebound (If you cast this spell from your hand, exile it as it resolves. At the beginning of your next upkeep, you may cast this card from exile without paying its mana cost.)"], "Phantom Monster": ["04303c0000ffff02", "Phantom Monster Flying"], "Repeal": ["3c3c2c00047fff00", "Repeal Return target nonland permanent with converted mana cost X to its owner's hand.\nDraw a card."], "Riverwheel Aerialists": ["1e3e08000e7f7f00", "Riverwheel Aerialists Flying\nProwess (Whenever you cast a noncreature spell, this creature gets +1/+1 until end of turn.)"], "Shriekgeist": ["1e040c0078ffff42", "Shriekgeist Flying\nWhenever Shriekgeist deals combat damage to a player, that player mills two cards."], "Skywise Teachings": ["0c3e623c3e7f7f00", "Skywise Teachings Whenever you cast a noncreature spell, you may pay {1}{U}. If you do, create a 2/2 blue Djinn Monk creature token with flying."], "Sphinx of Uthuun": ["0e06060002ffff02", "Sphinx of Uthuun Flying\nWhen Sphinx of Uthuun enters the battlefield, reveal the top five cards of your library. An opponent separates those cards into two piles. Put one pile into your hand and the other into your graveyard."], "Teferi, Mage of Zhalfir": ["60785602227f7f00", "Teferi, Mage of Zhalfir Flash (You may cast this spell any time you could cast an instant.)\nCreature cards you own that aren't on the battlefield have flash.\nEach opponent can cast spells only any time they could cast a sorcery."], "Thought Scour": ["1e0000066affff42", "Thought Scour Target player mills two cards.\nDraw a card."], "Windfall": ["1e0e0e0e1e7f7f00", "Windfall Each player discards their hand, then draws cards equal to the greatest number of cards a player discarded this way."], "Abyssal Persecutor": ["00347600007f7f42", "Abyssal Persecutor Flying, trample\nYou can't win the game and your opponents can't lose the game."], "Bala Ged Scorpion": ["0000000070ffff7e", "Bala Ged Scorpion When Bala Ged Scorpion enters the battlefield, you may destroy target creature with power 1 or less."], "Balustrade Spy": ["1e00000006ffff7e", "Balustrade Spy Flying\nWhen Balustrade Spy enters the battlefield, target player reveals cards from the top of their library until they reveal a land card, then puts those cards into their graveyard."], "Bladewings Thrall": ["00206620707e7e42", "Bladewings Thrall Bladewing's Thrall has flying as long as you control a Dragon.\nWhen a Dragon enters the battlefield, you may return Bladewing's Thrall from your graveyard to the battlefield."], "Bloodghast": ["00000c0006ffff4e", "Bloodghast Bloodghast can't block.\nBloodghast has haste as long as an opponent has 10 or less life.\nLandfall — Whenever a land enters the battlefield under your control, you may return Bloodghast from your graveyard to the battlefield."], "Bogbrew Witch": ["0800020066ffff7e", "Bogbrew Witch {2}, {T}: Search your library for a card named Festering Newt or Bubbling Cauldron, put it onto the battlefield tapped, then shuffle your library."], "Butchers Glee": ["007c44403a7e7e00", "Butchers Glee Target creature gets +3/+0 and gains lifelink until end of turn. Regenerate it. (Damage dealt by a creature with lifelink also causes its controller to gain that much life.)"], "Child of Night": ["0e00000046ffff7e", "Child of Night Lifelink"], "Dead Reveler": ["08400060667fff66", "Dead Reveler Unleash (You may have this creature enter the battlefield with a +1/+1 counter on it. It can't block as long as it has a +1/+1 counter on it.)"], "Doom Blade": ["007a1202007e7e40", "Doom Blade Destroy target nonblack creature."], "Duress": ["3208080024ffff7e", "Duress Target opponent reveals their hand. You choose a noncreature, nonland card from it. That player discards that card."], "Eternal Thirst": ["083c4640407f7f42", "Eternal Thirst Enchant creature\nEnchanted creature has lifelink and \"Whenever a creature an opponent controls dies, put a +1/+1 counter on this creature.\" (Damage dealt by a creature with lifelink also causes its controller to gain that much life.)"], "Festering Newt": ["0e00000000ffff7e", "Festering Newt When Festering Newt dies, target creature an opponent controls gets -1/-1 until end of turn. That creature gets -4/-4 instead if you control a creature named Bogbrew Witch."], "Foul-Tongue Invocation": ["08404040407e7f42", "Foul-Tongue Invocation As an additional cost to cast this spell, you may reveal a Dragon card from your hand.\nTarget player sacrifices a creature. If you revealed a Dragon card or controlled a Dragon as you cast this spell, you gain 4 life."], "Grisly Spectacle": ["086e4000787e7e00", "Grisly Spectacle Destroy target nonartifact creature. Its controller mills cards equal to that creature's power."], "Haunting Hymn": ["0c0000007affff6e", "Haunting Hymn Target player discards two cards. If you cast this spell during your main phase, that player discards four cards instead."], "Indulgent Tormentor": ["3c0800003cffff7e", "Indulgent Tormentor Flying\nAt the beginning of your upkeep, draw a card unless target opponent sacrifices a creature or pays 3 life."], "Kokusho, the Evening Star": ["3c704000007f7f46", "Kokusho, the Evening Star Flying\nWhen Kokusho, the Evening Star dies, each opponent loses 5 life. You gain life equal to the life lost this way."], "Lord of the Pit": ["0000005e7c7fff4e", "Lord of the Pit Flying, trample\nAt the beginning of your upkeep, sacrifice a creature other than Lord of the Pit. If you can't, Lord of the Pit deals 7 damage to you."], "Mer-Ek Nightblade": ["0060600000ffff7e", "Mer-Ek Nightblade Outlast {B} ({B}, {T}: Put a +1/+1 counter on this creature. Outlast only as a sorcery.)\nEach creature you control with a +1/+1 counter on it has deathtouch."], "Necropotence": ["0800000046ffff7e", "Necropotence Skip your draw step.\nWhenever you discard a card, exile that card from your graveyard.\nPay 1 life: Exile the top card of your library face down. Put that card into your hand at the beginning of your next end step."], "Night of Souls Betrayal": ["003c3e081c7e7e40", "Night of Souls Betrayal All creatures get -1/-1."], "Noxious Dragon": ["087a4040667e7e02", "Noxious Dragon Flying\nWhen Noxious Dragon dies, you may destroy target creature with converted mana cost 3 or less."], "Ob Nixilis, the Fallen": ["00304000327fff66", "Ob Nixilis, the Fallen Landfall — Whenever a land enters the battlefield under your control, you may have target player lose 3 life. If you do, put three +1/+1 counters on Ob Nixilis, the Fallen."], "Phyrexian Rager": ["02060e027e7e7e00", "Phyrexian Rager When Phyrexian Rager enters the battlefield, you draw a card and you lose 1 life."], "Rakdos Drake": ["0e0000001effff76", "Rakdos Drake Flying\nUnleash (You may have this creature enter the battlefield with a +1/+1 counter on it. It can't block as long as it has a +1/+1 counter on it.)"], "Reave Soul": ["124000026e7fff66", "Reave Soul Destroy target creature with power 3 or less."], "Rotfeaster Maggot": ["00007c2c1e7e7e62", "Rotfeaster Maggot When Rotfeaster Maggot enters the battlefield, exile target creature card from a graveyard. You gain life equal to that card's toughness."], "Rune-Scarred Demon": ["00000064767fff46", "Rune-Scarred Demon Flying\nWhen Rune-Scarred Demon enters the battlefield, search your library for a card, put it into your hand, then shuffle your library."], "Sanguine Bond": ["18386400007fff66", "Sanguine Bond Whenever you gain life, target opponent loses that much life."], "Sheoldred, Whispering One": ["001262000a7f7f5a", "Sheoldred, Whispering One Swampwalk (This creature can't be blocked as long as defending player controls a Swamp.)\nAt the beginning of your upkeep, return target creature card from your graveyard to the battlefield.\nAt the beginning of each opponent's upkeep, that player sacrifices a creature."], "Tavern Swindler": ["0008580040ffff7e", "Tavern Swindler {T}, Pay 3 life: Flip a coin. If you win the flip, you gain 6 life."], "Thoughtseize": ["10380c0c387f7f00", "Thoughtseize Target player reveals their hand. You choose a nonland card from it. That player discards that card. You lose 2 life."], "Thrill-Kill Assassin": ["0008080020ffff66", "Thrill-Kill Assassin Deathtouch\nUnleash (You may have this creature enter the battlefield with a +1/+1 counter on it. It can't block as long as it has a +1/+1 counter on it.)"], "Ulcerate": ["102000004e7fff66", "Ulcerate Target creature gets -3/-3 until end of turn. You lose 3 life."], "Virulent Swipe": ["1e180004067f7f46", "Virulent Swipe Target creature gets +2/+0 and gains deathtouch until end of turn.\nRebound (If you cast this spell from your hand, exile it as it resolves. At the beginning of your next upkeep, you may cast this card from exile without paying its mana cost.)"], "Wight of Precinct Six": ["560600006a7fff7e", "Wight of Precinct Six Wight of Precinct Six gets +1/+1 for each creature card in your opponents' graveyards."], "Wrench Mind": ["00101076767e7e00", "Wrench Mind Target player discards two cards unless they discard an artifact card."], "Anger of the Gods": ["4e0000003effff7e", "Anger of the Gods Anger of the Gods deals 3 damage to each creature. If a creature dealt damage this way would die this turn, exile it instead."], "Battle-Rattle Shaman": ["0600000206ffff42", "Battle-Rattle Shaman At the beginning of combat on your turn, you may have target creature get +2/+0 until end of turn."], "Bogardan Hellkite": ["0c0008082effff62", "Bogardan Hellkite Flash\nFlying\nWhen Bogardan Hellkite enters the battlefield, it deals 5 damage divided as you choose among any number of targets."], "Borderland Marauder": ["066e2206067e7f00", "Borderland Marauder Whenever Borderland Marauder attacks, it gets +2/+0 until end of turn."], "Charmbreaker Devils": ["764008181cffff42", "Charmbreaker Devils At the beginning of your upkeep, return an instant or sorcery card at random from your graveyard to your hand.\nWhenever you cast an instant or sorcery spell, Charmbreaker Devils gets +4/+0 until end of turn."], "Coordinated Assault": ["4e7e0e02007e7f00", "Coordinated Assault Up to two target creatures each get +1/+0 and gain first strike until end of turn."], "Crucible of Fire": ["1e0e100000ffff42", "Crucible of Fire Dragon creatures you control get +3/+3."], "Draconic Roar": ["001e0666667e7e00", "Draconic Roar As an additional cost to cast this spell, you may reveal a Dragon card from your hand.\nDraconic Roar deals 3 damage to target creature. If you revealed a Dragon card or controlled a Dragon as you cast this spell, Draconic Roar deals 3 damage to that creature's controller."], "Dragon Egg": ["7e1010000effff6e", "Dragon Egg Defender\nWhen Dragon Egg dies, create a 2/2 red Dragon creature token with flying and \"{R}: This creature gets +1/+0 until end of turn.\""], "Dragon Tempest": ["4e040c0010ffff00", "Dragon Tempest Whenever a creature with flying enters the battlefield under your control, it gains haste until end of turn.\nWhenever a Dragon enters the battlefield under your control, it deals X damage to any target, where X is the number of Dragons you control."], "Dragonlords Servant": ["74660644607f7f02", "Dragonlords Servant Dragon spells you cast cost {1} less to cast."], "Earth Elemental": ["0c7c18407e7e7f00", "Earth Elemental "], "Fireball": ["0e060e0e7e7e7f00", "Fireball This spell costs {1} more to cast for each target beyond the first.\nFireball deals X damage divided evenly, rounded down, among any number of targets."], "Furnace Whelp": ["7c0400000cffff62", "Furnace Whelp Flying (This creature can't be blocked except by creatures with flying or reach.)\n{R}: Furnace Whelp gets +1/+0 until end of turn."], "Fury Charm": ["1c00600018ffff42", "Fury Charm Choose one —\n• Destroy target artifact.\n• Target creature gets +1/+1 and gains trample until end of turn.\n• Remove two time counters from target permanent or suspended card."], "Guttersnipe": ["3c18080046ffff62", "Guttersnipe Whenever you cast an instant or sorcery spell, Guttersnipe deals 2 damage to each opponent."], "Hammerhand": ["1c0800047effff42", "Hammerhand Enchant creature\nWhen Hammerhand enters the battlefield, target creature can't block this turn.\nEnchanted creature gets +1/+1 and has haste. (It can attack and {T} no matter when it came under your control.)"], "Heat Ray": ["00607800007fff00", "Heat Ray Heat Ray deals X damage to target creature."], "Hoarding Dragon": ["7c0000005cffff42", "Hoarding Dragon Flying\nWhen Hoarding Dragon enters the battlefield, you may search your library for an artifact card, exile it, then shuffle your library.\nWhen Hoarding Dragon dies, you may put the exiled card into its owner's hand."], "Keldon Halberdier": ["0c7c6662667e7e00", "Keldon Halberdier First strike\nSuspend 4—{R} (Rather than cast this card from your hand, you may pay {R} and exile it with four time counters on it. At the beginning of your upkeep, remove a time counter. When the last is removed, cast it without paying its mana cost. It has haste.)"], "Kiki-Jiki, Mirror Breaker": ["7c664200667fff42", "Kiki-Jiki, Mirror Breaker Haste\n{T}: Create a token that's a copy of target nonlegendary creature you control, except it has haste. Sacrifice it at the beginning of the next end step."], "Kiln Fiend": ["1e3600007cffff42", "Kiln Fiend Whenever you cast an instant or sorcery spell, Kiln Fiend gets +3/+0 until end of turn."], "Magus of the Moon": ["7e4c400010ffff62", "Magus of the Moon Nonbasic lands are Mountains."], "Mark of Mutiny": ["1e0c04007effff7e", "Mark of Mutiny Gain control of target creature until end of turn. Put a +1/+1 counter on it and untap it. That creature gains haste until end of turn. (It can attack and {T} this turn.)"], "Monastery Swiftspear": ["06502000707fff02", "Monastery Swiftspear Haste\nProwess (Whenever you cast a noncreature spell, this creature gets +1/+1 until end of turn.)"], "Pillar of Flame": ["0e0200101affff42", "Pillar of Flame Pillar of Flame deals 2 damage to any target. If a creature dealt damage this way would die this turn, exile it instead."], "Prodigal Pyromancer": ["04000c227effff62", "Prodigal Pyromancer {T}: Prodigal Pyromancer deals 1 damage to any target."], "Rift Bolt": ["3e1010007effff7e", "Rift Bolt Rift Bolt deals 3 damage to any target.\nSuspend 1—{R} (Rather than cast this card from your hand, you may pay {R} and exile it with a time counter on it. At the beginning of your upkeep, remove a time counter. When the last is removed, cast it without paying its mana cost.)"], "Ryusei, the Falling Star": ["066440007e7f7f02", "Ryusei, the Falling Star Flying\nWhen Ryusei, the Falling Star dies, it deals 5 damage to each creature without flying."], "Scourge of Valkas": ["18704610787f7f02", "Scourge of Valkas Flying\nWhenever Scourge of Valkas or another Dragon enters the battlefield under your control, it deals X damage to any target, where X is the number of Dragons you control.\n{R}: Scourge of Valkas gets +1/+0 until end of turn."], "Splatter Thug": ["1e664000767f7f02", "Splatter Thug First strike\nUnleash (You may have this creature enter the battlefield with a +1/+1 counter on it. It can't block as long as it has a +1/+1 counter on it.)"], "Staggershock": ["0e0e0c08027f7f00", "Staggershock Staggershock deals 2 damage to any target.\nRebound (If you cast this spell from your hand, exile it as it resolves. At the beginning of your next upkeep, you may cast this card from exile without paying its mana cost.)"], "Surreal Memoir": ["4e061600027fff40", "Surreal Memoir Return an instant card at random from your graveyard to your hand.\nRebound (If you cast this spell from your hand, exile it as it resolves. At the beginning of your next upkeep, you may cast this card from exile without paying its mana cost.)"], "Thundermaw Hellkite": ["0c0000003effff7e", "Thundermaw Hellkite Flying\nHaste (This creature can attack and {T} as soon as it comes under your control.)\nWhen Thundermaw Hellkite enters the battlefield, it deals 1 damage to each creature with flying your opponents control. Tap those creatures."], "Tormenting Voice": ["4e00100042ffff4e", "Tormenting Voice As an additional cost to cast this spell, discard a card.\nDraw two cards."], "Trumpet Blast": ["1e6e02006e7fff00", "Trumpet Blast Attacking creatures get +2/+0 until end of turn."], "Urabrask the Hidden": ["0e0000000effff7e", "Urabrask the Hidden Creatures you control have haste.\nCreatures your opponents control enter the battlefield tapped."], "Vent Sentinel": ["1e1c000002ffff42", "Vent Sentinel Defender\n{1}{R}, {T}: Vent Sentinel deals damage to target player or planeswalker equal to the number of creatures with defender you control."], "Aerial Predation": ["7e02020000ffff46", "Aerial Predation Destroy target creature with flying. You gain 2 life."], "Assault Formation": ["087e7e10007e7e00", "Assault Formation Each creature you control assigns combat damage equal to its toughness rather than its power.\n{G}: Target creature with defender can attack this turn as though it didn't have defender.\n{2}{G}: Creatures you control get +0/+1 until end of turn."], "Carven Caryatid": ["0c0062000effff02", "Carven Caryatid Defender (This creature can't attack.)\nWhen Carven Caryatid enters the battlefield, draw a card."], "Channel": ["024a7622327f7f00", "Channel Until end of turn, any time you could activate a mana ability, you may pay 1 life. If you do, add {C}."], "Crowned Ceratok": ["083806007e7f7f00", "Crowned Ceratok Trample\nEach creature you control with a +1/+1 counter on it has trample."], "Curse of Predation": ["4e00030346ffff42", "Curse of Predation Enchant player\nWhenever a creature attacks enchanted player, put a +1/+1 counter on it."], "Durkwood Baloth": ["086602007e7e7e00", "Durkwood Baloth Suspend 5—{G} (Rather than cast this card from your hand, you may pay {G} and exile it with five time counters on it. At the beginning of your upkeep, remove a time counter. When the last is removed, cast it without paying its mana cost. It has haste.)"], "Duskdale Wurm": ["1c04407064ffff42", "Duskdale Wurm Trample (This creature can deal excess combat damage to the player or planeswalker it's attacking.)"], "Enlarge": ["3c7c6800007e7f00", "Enlarge Target creature gets +7/+7 and gains trample until end of turn. It must be blocked this turn if able. (A creature with trample can deal excess combat damage to the player or planeswalker it's attacking.)"], "Genesis Hydra": ["586060005c7f7f02", "Genesis Hydra When you cast this spell, reveal the top X cards of your library. You may put a nonland permanent card with converted mana cost X or less from among them onto the battlefield. Then shuffle the rest into your library.\nGenesis Hydra enters the battlefield with X +1/+1 counters on it."], "Genesis Wave": ["7e1e180010ffff00", "Genesis Wave Reveal the top X cards of your library. You may put any number of permanent cards with converted mana cost X or less from among them onto the battlefield. Then put all cards revealed this way that weren't put onto the battlefield into your graveyard."], "Greater Basilisk": ["5c10060e1affff42", "Greater Basilisk Deathtouch (Any amount of damage this deals to a creature is enough to destroy it.)"], "Heroes Bane": ["1e2f1200007f7f00", "Heroes Bane Heroes' Bane enters the battlefield with four +1/+1 counters on it.\n{2}{G}{G}: Put X +1/+1 counters on Heroes' Bane, where X is its power."], "Hunt the Weak": ["18602800407f7f00", "Hunt the Weak Put a +1/+1 counter on target creature you control. Then that creature fights target creature you don't control. (Each deals damage equal to its power to the other.)"], "Hunting Pack": ["1c0606003eff7f40", "Hunting Pack Create a 4/4 green Beast creature token.\nStorm (When you cast this spell, copy it for each spell cast before it this turn.)"], "Inspiring Call": ["1e7e7000727f7f00", "Inspiring Call Draw a card for each creature you control with a +1/+1 counter on it. Those creatures gain indestructible until end of turn."], "Ivy Elemental": ["1c184848587f7f00", "Ivy Elemental Ivy Elemental enters the battlefield with X +1/+1 counters on it."], "Jaddi Offshoot": ["08701e08107f7f00", "Jaddi Offshoot Defender\nLandfall — Whenever a land enters the battlefield under your control, you gain 1 life."], "Jugan, the Rising Star": ["206e48202c7f7f00", "Jugan, the Rising Star Flying\nWhen Jugan, the Rising Star dies, you may distribute five +1/+1 counters among any number of target creatures."], "Lead the Stampede": ["0e20020038ffff42", "Lead the Stampede Look at the top five cards of your library. You may reveal any number of creature cards from among them and put the revealed cards into your hand. Put the rest on the bottom of your library in any order."], "Lotus Cobra": ["7e3c100068ffff42", "Lotus Cobra Landfall — Whenever a land enters the battlefield under your control, add one mana of any color."], "Lure": ["3c00044842ffff02", "Lure Enchant creature\nAll creatures able to block enchanted creature do so."], "Nantuko Shaman": ["007e7e0c007e7e00", "Nantuko Shaman When Nantuko Shaman enters the battlefield, if you control no tapped lands, draw a card.\nSuspend 1—{2}{G}{G} (Rather than cast this card from your hand, you may pay {2}{G}{G} and exile it with a time counter on it. At the beginning of your upkeep, remove a time counter. When the last is removed, cast it without paying its mana cost. It has haste.)"], "Natures Claim": ["0e0000067e7fff00", "Natures Claim Destroy target artifact or enchantment. Its controller gains 4 life."], "Netcaster Spider": ["6e02080004ffff62", "Netcaster Spider Reach (This creature can block creatures with flying.)\nWhenever Netcaster Spider blocks a creature with flying, Netcaster Spider gets +2/+0 until end of turn."], "Obstinate Baloth": ["7e3c00001effff42", "Obstinate Baloth When Obstinate Baloth enters the battlefield, you gain 4 life.\nIf a spell or ability an opponent controls causes you to discard Obstinate Baloth, put it onto the battlefield instead of putting it into your graveyard."], "Overgrown Battlement": ["3e1800001effff02", "Overgrown Battlement Defender\n{T}: Add {G} for each creature with defender you control."], "Phantom Tiger": ["5e3e000008ffff7e", "Phantom Tiger Phantom Tiger enters the battlefield with two +1/+1 counters on it.\nIf damage would be dealt to Phantom Tiger, prevent that damage. Remove a +1/+1 counter from Phantom Tiger."], "Preys Vengeance": ["0e4e0e087e7e7e00", "Preys Vengeance Target creature gets +2/+2 until end of turn.\nRebound (If you cast this spell from your hand, exile it as it resolves. At the beginning of your next upkeep, you may cast this card from exile without paying its mana cost.)"], "Primeval Titan": ["3c3c040002ffff46", "Primeval Titan Trample\nWhenever Primeval Titan enters the battlefield or attacks, you may search your library for up to two land cards, put them onto the battlefield tapped, then shuffle your library."], "Rampaging Baloths": ["6e7800005c7fff02", "Rampaging Baloths Trample\nLandfall — Whenever a land enters the battlefield under your control, you may create a 4/4 green Beast creature token."], "Search for Tomorrow": ["046e6662627e7f00", "Search for Tomorrow Search your library for a basic land card, put it onto the battlefield, then shuffle your library.\nSuspend 2—{G} (Rather than cast this card from your hand, you may pay {G} and exile it with two time counters on it. At the beginning of your upkeep, remove a time counter. When the last is removed, cast it without paying its mana cost.)"], "Sultai Flayer": ["1e0000007effff46", "Sultai Flayer Whenever a creature you control with toughness 4 or greater dies, you gain 4 life."], "Timberland Guide": ["7e4e4000507fff02", "Timberland Guide When Timberland Guide enters the battlefield, put a +1/+1 counter on target creature."], "Undercity Troll": ["5e0000007cffff7e", "Undercity Troll Renown 1 (When this creature deals combat damage to a player, if it isn't renowned, put a +1/+1 counter on it and it becomes renowned.)\n{2}{G}: Regenerate Undercity Troll. (The next time this creature would be destroyed this turn, it isn't. Instead tap it, remove all damage from it, and remove it from combat.)"], "Vorinclex, Voice of Hunger": ["764040000cffff02", "Vorinclex, Voice of Hunger Trample\nWhenever you tap a land for mana, add one mana of any type that land produced.\nWhenever an opponent taps a land for mana, that land doesn't untap during its controller's next untap step."], "Wall of Roots": ["0e06070200ffff02", "Wall of Roots Defender\nPut a -0/-1 counter on Wall of Roots: Add {G}. Activate this ability only once each turn."], "Wildsize": ["206e4e021a7e7e00", "Wildsize Target creature gets +2/+2 and gains trample until end of turn.\nDraw a card."], "Azorius Charm": ["007a7a40707e7e00", "Azorius Charm Choose one —\n• Creatures you control gain lifelink until end of turn.\n• Draw a card.\n• Put target attacking or blocking creature on top of its owner's library."], "Bladewing the Risen": ["38780002607fff02", "Bladewing the Risen Flying\nWhen Bladewing the Risen enters the battlefield, you may return target Dragon permanent card from your graveyard to the battlefield.\n{B}{R}: Dragon creatures get +1/+1 until end of turn."], "Blizzard Specter": ["0c1c084c7c7e7f00", "Blizzard Specter Flying\nWhenever Blizzard Specter deals combat damage to a player, choose one —\n• That player returns a permanent they control to its owner's hand.\n• That player discards a card."], "Blood Baron of Vizkopa": ["343c300000ffff40", "Blood Baron of Vizkopa Lifelink, protection from white and from black\nAs long as you have 30 or more life and an opponent has 10 or less life, Blood Baron of Vizkopa gets +6/+6 and has flying."], "Chronicler of Heroes": ["1e1f000000ffff46", "Chronicler of Heroes When Chronicler of Heroes enters the battlefield, draw a card if you control a creature with a +1/+1 counter on it."], "Corpsejack Menace": ["0c00004050ffff7e", "Corpsejack Menace If one or more +1/+1 counters would be put on a creature you control, twice that many +1/+1 counters are put on it instead."], "Electrolyze": ["18603000007fff00", "Electrolyze Electrolyze deals 2 damage divided as you choose among one or two targets.\nDraw a card."], "Firemane Angel": ["043032000e7f7f00", "Firemane Angel Flying, first strike\nAt the beginning of your upkeep, if Firemane Angel is in your graveyard or on the battlefield, you may gain 1 life.\n{6}{R}{R}{W}{W}: Return Firemane Angel from your graveyard to the battlefield. Activate this ability only during your upkeep."], "Glimpse the Unthinkable": ["3c00000020ffff7e", "Glimpse the Unthinkable Target player mills ten cards."], "Hypersonic Dragon": ["70f04000587fff00", "Hypersonic Dragon Flying, haste\nYou may cast sorcery spells as though they had flash. (You may cast them any time you could cast an instant.)"], "Jungle Barrier": ["7e06000000ffff6e", "Jungle Barrier Defender (This creature can't attack.)\nWhen Jungle Barrier enters the battlefield, draw a card."], "Knight of the Reliquary": ["0e644400207fff00", "Knight of the Reliquary Knight of the Reliquary gets +1/+1 for each land card in your graveyard.\n{T}, Sacrifice a Forest or Plains: Search your library for a land card, put it onto the battlefield, then shuffle your library."], "Lightning Helix": ["0e0e1c10107f7f02", "Lightning Helix Lightning Helix deals 3 damage to any target and you gain 3 life."], "Malfegor": ["1c002043767fff40", "Malfegor Flying\nWhen Malfegor enters the battlefield, discard your hand. Each opponent sacrifices a creature for each card discarded this way."], "Rosheen Meanderer": ["7e60000010ffff66", "Rosheen Meanderer {T}: Add {C}{C}{C}{C}. Spend this mana only on costs that contain {X}."], "Savageborn Hydra": ["0e664400107f7f00", "Savageborn Hydra Double strike\nSavageborn Hydra enters the battlefield with X +1/+1 counters on it.\n{1}{R/G}: Put a +1/+1 counter on Savageborn Hydra. Activate this ability only any time you could cast a sorcery."], "Simic Sky Swallower": ["0c0200667e7f7f00", "Simic Sky Swallower Flying, trample\nShroud (This creature can't be the target of spells or abilities.)"], "Spiritmonger": ["1c676260407f7f00", "Spiritmonger Whenever Spiritmonger deals damage to a creature, put a +1/+1 counter on Spiritmonger.\n{B}: Regenerate Spiritmonger.\n{G}: Spiritmonger becomes the color of your choice until end of turn."], "Supreme Verdict": ["00005e3830ffff00", "Supreme Verdict This spell can't be countered.\nDestroy all creatures."], "Vizkopa Guildmage": ["1c38301020ffff72", "Vizkopa Guildmage {1}{W}{B}: Target creature gains lifelink until end of turn.\n{1}{W}{B}: Whenever you gain life this turn, each opponent loses that much life."], "Scion of Ugin": ["6e4608007e7f7f02", "Scion of Ugin Flying"], "Aether Vial": ["1e0020207effff42", "Aether Vial At the beginning of your upkeep, you may put a charge counter on Aether Vial.\n{T}: You may put a creature card with converted mana cost equal to the number of charge counters on Aether Vial from your hand onto the battlefield."], "Bubbling Cauldron": ["7e0000007effff7e", "Bubbling Cauldron {1}, {T}, Sacrifice a creature: You gain 4 life.\n{1}, {T}, Sacrifice a creature named Festering Newt: Each opponent loses 4 life. You gain life equal to the life lost this way."], "Darksteel Axe": ["5e04000028ffff00", "Darksteel Axe Indestructible (Effects that say \"destroy\" don't destroy this artifact.)\nEquipped creature gets +2/+0.\nEquip {2}"], "Dragonloft Idol": ["7ef8600060ffff02", "Dragonloft Idol As long as you control a Dragon, Dragonloft Idol gets +1/+1 and has flying and trample."], "Guardian Idol": ["7e0000007effff76", "Guardian Idol Guardian Idol enters the battlefield tapped.\n{T}: Add {C}.\n{2}: Guardian Idol becomes a 2/2 Golem artifact creature until end of turn."], "Kolaghan Monument": ["5e04200272ffff00", "Kolaghan Monument {T}: Add {B} or {R}.\n{4}{B}{R}: Kolaghan Monument becomes a 4/4 black and red Dragon artifact creature with flying until end of turn."], "Manakin": ["7e0808085effff66", "Manakin {T}: Add {C}."], "Mind Stone": ["3e3848007e7fff00", "Mind Stone {T}: Add {C}.\n{1}, {T}, Sacrifice Mind Stone: Draw a card."], "Mindcrank": ["7e0000007effff66", "Mindcrank Whenever an opponent loses life, that player mills that many cards. (Damage dealt by sources without infect causes loss of life.)"], "Mishras Bauble": ["1e2400007effff00", "Mishras Bauble {T}, Sacrifice Mishra's Bauble: Look at the top card of target player's library. Draw a card at the beginning of the next turn's upkeep."], "Moonglove Extract": ["6e0020602effff40", "Moonglove Extract Sacrifice Moonglove Extract: It deals 2 damage to any target."], "Oblivion Stone": ["4e20180004ffff00", "Oblivion Stone {4}, {T}: Put a fate counter on target permanent.\n{5}, {T}, Sacrifice Oblivion Stone: Destroy each nonland permanent without a fate counter on it, then remove all fate counters from all permanents."], "Palladium Myr": ["0e1e46627e7e7e00", "Palladium Myr {T}: Add {C}{C}."], "Pristine Talisman": ["02383c100cffff40", "Pristine Talisman {T}: Add {C}. You gain 1 life."], "Runed Servitor": ["1e6020047effff00", "Runed Servitor When Runed Servitor dies, each player draws a card."], "Sandstone Oracle": ["7e0000004effff7e", "Sandstone Oracle Flying\nWhen Sandstone Oracle enters the battlefield, choose an opponent. If that player has more cards in hand than you, draw cards equal to the difference."], "Serum Powder": ["7e0030007cffff72", "Serum Powder {T}: Add {C}.\nAny time you could mulligan and Serum Powder is in your hand, you may exile all the cards from your hand, then draw that many cards. (You can do this in addition to taking mulligans.)"], "Star Compass": ["7e3800003cffff00", "Star Compass Star Compass enters the battlefield tapped.\n{T}: Add one mana of any color that a basic land you control could produce."], "Thran Dynamo": ["7e0a00007effff40", "Thran Dynamo {T}: Add {C}{C}{C}."], "Trepanation Blade": ["5e0e000002ffff62", "Trepanation Blade Whenever equipped creature attacks, defending player reveals cards from the top of their library until they reveal a land card. The creature gets +1/+0 until end of turn for each card revealed this way. That player puts the revealed cards into their graveyard.\nEquip {2}"], "Azorius Chancery": ["50303c3c3e7e7e00", "Azorius Chancery Azorius Chancery enters the battlefield tapped.\nWhen Azorius Chancery enters the battlefield, return a land you control to its owner's hand.\n{T}: Add {W}{U}."], "Boros Garrison": ["1e383a00047f7f02", "Boros Garrison Boros Garrison enters the battlefield tapped.\nWhen Boros Garrison enters the battlefield, return a land you control to its owner's hand.\n{T}: Add {R}{W}."], "Dimir Aqueduct": ["0e1c3c247c7e7e40", "Dimir Aqueduct Dimir Aqueduct enters the battlefield tapped.\nWhen Dimir Aqueduct enters the battlefield, return a land you control to its owner's hand.\n{T}: Add {U}{B}."], "Evolving Wilds": ["7e3e4040307f7f00", "Evolving Wilds {T}, Sacrifice Evolving Wilds: Search your library for a basic land card, put it onto the battlefield tapped, then shuffle your library."], "Golgari Rot Farm": ["7e383c002c7f7f02", "Golgari Rot Farm Golgari Rot Farm enters the battlefield tapped.\nWhen Golgari Rot Farm enters the battlefield, return a land you control to its owner's hand.\n{T}: Add {B}{G}."], "Graven Cairns": ["7e7e1e00007f7e00", "Graven Cairns {T}: Add {C}.\n{B/R}, {T}: Add {B}{B}, {B}{R}, or {R}{R}."], "Grove of the Burnwillows": ["7e660c00007f7f02", "Grove of the Burnwillows {T}: Add {C}.\n{T}: Add {R} or {G}. Each opponent gains 1 life."], "Gruul Turf": ["7e3810000c7f7f06", "Gruul Turf Gruul Turf enters the battlefield tapped.\nWhen Gruul Turf enters the battlefield, return a land you control to its owner's hand.\n{T}: Add {R}{G}."], "Horizon Canopy": ["7e40100000ffff46", "Horizon Canopy {T}, Pay 1 life: Add {G} or {W}.\n{1}, {T}, Sacrifice Horizon Canopy: Draw a card."], "Izzet Boilerworks": ["7e38400000ffff60", "Izzet Boilerworks Izzet Boilerworks enters the battlefield tapped.\nWhen Izzet Boilerworks enters the battlefield, return a land you control to its owner's hand.\n{T}: Add {U}{R}."], "Nimbus Maze": ["0000407e7e7e7e00", "Nimbus Maze {T}: Add {C}.\n{T}: Add {W}. Activate this ability only if you control an Island.\n{T}: Add {U}. Activate this ability only if you control a Plains."], "Orzhov Basilica": ["7e4218187cfefe60", "Orzhov Basilica Orzhov Basilica enters the battlefield tapped.\nWhen Orzhov Basilica enters the battlefield, return a land you control to its owner's hand.\n{T}: Add {W}{B}."], "Radiant Fountain": ["7e380c00007f7f00", "Radiant Fountain When Radiant Fountain enters the battlefield, you gain 2 life.\n{T}: Add {C}."], "Rakdos Carnarium": ["7e080818187f7f42", "Rakdos Carnarium Rakdos Carnarium enters the battlefield tapped.\nWhen Rakdos Carnarium enters the battlefield, return a land you control to its owner's hand.\n{T}: Add {B}{R}."], "River of Tears": ["5e08380078fffe70", "River of Tears {T}: Add {U}. If you played a land this turn, add {B} instead."], "Selesnya Sanctuary": ["06181c3c7e7e7f00", "Selesnya Sanctuary Selesnya Sanctuary enters the battlefield tapped.\nWhen Selesnya Sanctuary enters the battlefield, return a land you control to its owner's hand.\n{T}: Add {G}{W}."], "Shimmering Grotto": ["0e0804041cffff46", "Shimmering Grotto {T}: Add {C}.\n{1}, {T}: Add one mana of any color."], "Simic Growth Chamber": ["00007c7e7e7e7e00", "Simic Growth Chamber Simic Growth Chamber enters the battlefield tapped.\nWhen Simic Growth Chamber enters the battlefield, return a land you control to its owner's hand.\n{T}: Add {G}{U}."]}